shen-elisp.org
#+TITLE: Shen Elisp
#+AUTHOR: Aditya Siram
#+PROPERTY: header-args    :comments noweb
#+OPTIONS: ^:nil ;; let an underscore be an underscore, disable sub-superscripting
#+OPTIONS: timestamp:nil

* Package Details
#+BEGIN_SRC elisp :tangle shen-elisp-pkg.el
  (define-package
    "shen-elisp"
    "19.2-0.0.1"
    "Shen implementation in Elisp"
    '((emacs "24.4"))
    :url "http://github.com/deech/shen-elisp"
    :keywords '("shen" "elisp"))
#+END_SRC
* KLambda Primitives
** License
#+BEGIN_SRC elisp :tangle shen-primitives.el
  ;; -*- lexical-binding: t -*-
  ;; Copyright (c) 2015-2018 Aditya Siram. All Rights Reserved.
  ;; BSD 3-Clause License: http://opensource.org/licenses/BSD-3-Clause
#+END_SRC
** Dependencies
This emacs-distributed macro library is required for cl-flet,
which is used for lexically-bound functions:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (require 'cl-macs)
#+END_SRC
** Implementation Constants
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defconst shen/prefix "shen/")
#+END_SRC
** Symbols
Symbols in KLambda (and Shen) are very much like symbols in Elisp :

#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/symbol-p (X)
    (not (or (consp X) (bufferp X) (vectorp X) (numberp X) (stringp X))))
#+END_SRC

except for a few important differences:
1. In KLambda (and Shen) symbols don't need to be quoted:
   #+BEGIN_EXAMPLE
    > some-symbol
    some-symbol
   #+END_EXAMPLE
   whereras in Elisp they do:
   #+BEGIN_EXAMPLE elisp
     > some-symbol
     *** Eval error ***  Symbol's value as variable is void: some-symbol
     > 'some-symbol
     some-symbol
   #+END_EXAMPLE

2. When calling a symbol function in Shen you can
   simply apply the arguments:
   #+BEGIN_EXAMPLE
     (defun call-f (f a b c) (f a b c))
   #+END_EXAMPLE
   But in Elisp we need to use ~funcall~:
   #+BEGIN_EXAMPLE
   (defun call-f (f a b c) (funcall f a b c))
   #+END_EXAMPLE

To deal with these differences a [[Walking The AST][pass]] is taken over the KLambda ast (before
macroexpansion) that identifies symbols that requires quoting and function calls
that need to be applied correctly.

Interning a Shen symbol delegates to Elisp's ~intern~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/intern (String)
    (intern String))
#+END_SRC

as does ~shen/symbol->string~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/symbol->string (X)
    (symbol-name X))
#+END_SRC
