shen-elisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shen Elisp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Aditya Siram" />
</head>
<body>
<div id="content">
<h1 class="title">Shen Elisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc100d3b">1. Package Details</a></li>
<li><a href="#orgef5269d">2. KLambda Primitives</a>
<ul>
<li><a href="#org6372af0">2.1. License</a></li>
<li><a href="#org545e034">2.2. Implementation Constants</a></li>
<li><a href="#orgc880d93">2.3. Symbols</a>
<ul>
<li><a href="#orgd8bb037">2.3.1. Prefixing Utilities</a></li>
</ul>
</li>
<li><a href="#orgf703c38">2.4. Assignments</a></li>
<li><a href="#org4653727">2.5. KLambda Constants</a></li>
<li><a href="#orgc519f8d">2.6. Boolean Operations</a></li>
<li><a href="#orgae0d3ce">2.7. Lambdas</a></li>
<li><a href="#orgcc47851">2.8. Lets</a></li>
<li><a href="#org3ea342a">2.9. Defuns</a></li>
<li><a href="#org32d53b0">2.10. Equality</a></li>
<li><a href="#orga46275c">2.11. Other Generic Functions</a></li>
<li><a href="#orgc69bed8">2.12. Lists</a></li>
<li><a href="#orgbcfdd2a">2.13. Strings</a></li>
<li><a href="#org32d5bd2">2.14. Error Handling</a></li>
<li><a href="#org79fade9">2.15. Vectors</a></li>
<li><a href="#orgfb653f1">2.16. Arithmetic Operations</a></li>
<li><a href="#orgfea81be">2.17. Time</a></li>
<li><a href="#orgf023406">2.18. Streams and I/O</a></li>
</ul>
</li>
<li><a href="#orgf93b424">3. Utilities</a>
<ul>
<li><a href="#orgf9ca75c">3.1. Lookup</a></li>
<li><a href="#org2d7f67d">3.2. AST Utilities</a>
<ul>
<li><a href="#org1fede55">3.2.1. Paths</a></li>
<li><a href="#org08564fd">3.2.2. AST Getter/Setter</a></li>
<li><a href="#orgb29fa7a">3.2.3. AST Search</a></li>
<li><a href="#org01abc05">3.2.4. Path Utilities</a></li>
<li><a href="#org95a33fd">3.2.5. AST Modification</a></li>
</ul>
</li>
<li><a href="#orgc18f8b2">3.3. List</a>
<ul>
<li><a href="#org43887e7">3.3.1. Detect Dotted Pair</a></li>
<li><a href="#org88789e5">3.3.2. List Filtering</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb538ab3">4. Rewriting The AST</a>
<ul>
<li><a href="#org8ffa5f1">4.1. Walking The AST</a></li>
<li><a href="#org52f0e1d">4.2. Function Application</a></li>
<li><a href="#org7050be6">4.3. Finding Tail Calls</a></li>
<li><a href="#org202a339">4.4. Generating A TCO'ed Function</a></li>
<li><a href="#org521dfcf">4.5. Modifying The AST</a></li>
<li><a href="#org5bc6dbb">4.6. (Unused) Isolating and Filling</a></li>
</ul>
</li>
<li><a href="#org8991d7e">5. Optimizations</a>
<ul>
<li><a href="#org4db61ef">5.1. Consolidate Call Chains</a></li>
<li><a href="#org29f34f3">5.2. Consolidate Cons</a></li>
<li><a href="#org7ac6d10">5.3. Consolidate @s</a></li>
<li><a href="#org55b123b">5.4. Consolidate tl</a></li>
<li><a href="#org080ef92">5.5. Add 1+'s</a></li>
<li><a href="#org749c258">5.6. Nil Comparisons To Null</a></li>
</ul>
</li>
<li><a href="#orgeed8f15">6. Overrides</a>
<ul>
<li><a href="#orgb099cae">6.1. Performance</a></li>
<li><a href="#org3da0e33">6.2. Hash Table</a></li>
<li><a href="#org5400114">6.3. Namespacing</a></li>
<li><a href="#org84f1566">6.4. Bug Fixes</a></li>
</ul>
</li>
<li><a href="#org6d93d5a">7. Evaluate KLambda</a>
<ul>
<li><a href="#orgc281f1f">7.1. Generate From Seed KLambda Files</a>
<ul>
<li><a href="#org34c67da">7.1.1. Evaluating Bootstrapped KLambda</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5b7fbf5">8. Providing The Primitives</a></li>
<li><a href="#orgc420a27">9. Overlays</a>
<ul>
<li><a href="#orga4f7f1a">9.1. License</a></li>
<li><a href="#org2ffa05c">9.2. Symbol Table</a></li>
<li><a href="#orgc0d74ec">9.3. Repl</a>
<ul>
<li><a href="#orgf35e81e">9.3.1. Questions</a></li>
<li><a href="#org79ef188">9.3.2. Changing Directories</a></li>
</ul>
</li>
<li><a href="#org7605357">9.4. Provide it</a></li>
</ul>
</li>
<li><a href="#org7cf0e03">10. Shen REPL</a>
<ul>
<li><a href="#org2401594">10.1. Credits</a></li>
<li><a href="#orgc914fd4">10.2. Prompt</a></li>
<li><a href="#orgaacaf97">10.3. Input Events</a></li>
<li><a href="#org37268e6">10.4. Sending Input</a></li>
<li><a href="#org9e4d6b2">10.5. Evaluating User Input</a></li>
<li><a href="#orge6d04f7">10.6. The REPL Mode</a></li>
<li><a href="#org06658cf">10.7. Starting the REPL</a></li>
<li><a href="#org270053c">10.8. Provide it</a></li>
</ul>
</li>
<li><a href="#orgb70a2fe">11. Bootstrap</a>
<ul>
<li><a href="#org3d4557f">11.1. Collecting KLambda files</a></li>
<li><a href="#org31e1acb">11.2. Modifying The Elisp Reader For KLambda</a></li>
<li><a href="#org88f1618">11.3. Iterating over KLambda Files</a></li>
</ul>
</li>
<li><a href="#org12cfa52">12. The Runner</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc100d3b" class="outline-2">
<h2 id="orgc100d3b"><span class="section-number-2">1</span> Package Details</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span>define-package
  <span style="color: #008000;">"shen-elisp"</span>
  <span style="color: #008000;">"19.2-0.0.1"</span>
  <span style="color: #008000;">"Shen implementation in Elisp"</span>
  '<span style="color: #7388D6;">(</span><span style="color: #909183;">(</span>emacs <span style="color: #008000;">"24.4"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #006FE0;">:url</span> <span style="color: #008000;">"http://github.com/deech/shen-elisp"</span>
  <span style="color: #006FE0;">:keywords</span> '<span style="color: #7388D6;">(</span><span style="color: #008000;">"shen"</span> <span style="color: #008000;">"elisp"</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef5269d" class="outline-2">
<h2 id="orgef5269d"><span class="section-number-2">2</span> KLambda Primitives</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org6372af0" class="outline-3">
<h3 id="org6372af0"><span class="section-number-3">2.1</span> License</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Copyright (c) 2015-2016 Aditya Siram. All Rights Reserved.</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">BSD 3-Clause License: http://opensource.org/licenses/BSD-3-Clause</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org545e034" class="outline-3">
<h3 id="org545e034"><span class="section-number-3">2.2</span> Implementation Constants</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defconst</span> <span style="color: #BA36A5;">shen/prefix</span> <span style="color: #008000;">"shen/"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc880d93" class="outline-3">
<h3 id="orgc880d93"><span class="section-number-3">2.3</span> Symbols</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Symbols in KLambda (and Shen) are very much like symbols in Elisp :
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/symbol-p</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>not <span style="color: #909183;">(</span><span style="color: #0000FF;">or</span> <span style="color: #709870;">(</span>consp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>bufferp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>vectorp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>numberp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>stringp X<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
except for a few important differences:
</p>
<ol class="org-ol">
<li><p>
In KLambda (and Shen) symbols don't need to be quoted:
</p>
<pre class="example">
&gt; some-symbol
some-symbol
</pre>
<p>
whereras in Elisp they do:
</p>
<pre class="example">
&gt; some-symbol
*** Eval error ***  Symbol's value as variable is void: some-symbol
&gt; 'some-symbol
some-symbol
</pre></li>

<li><p>
When calling a symbol function in Shen you can
simply apply the arguments:
</p>
<pre class="example">
(defun call-f (f a b c) (f a b c))
</pre>
<p>
But in Elisp we need to use <code>funcall</code>:
</p>
<pre class="example">
(defun call-f (f a b c) (funcall f a b c))
</pre></li>
</ol>

<p>
To deal with these differences a <a href="#org8ffa5f1">pass</a> is taken over the KLambda ast (before
macroexpansion) that identifies symbols that requires quoting and function calls
that need to be applied correctly.
</p>

<p>
Interning a Shen symbol delegates to Elisp's <code>intern</code>:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/intern</span> <span style="color: #7388D6;">(</span>String<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>intern String<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
as does <code>shen/symbol-&gt;string</code>:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/symbol-&gt;string</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>symbol-name X<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
