shen-elisp.org
*** Prefixing Utilities
Elisp does not have namespaces so to insulate the rest of the user's Emacs image
the primitive functions, user-defined functions and variables are prefixed with ~shen/~.
Raw symbols are not touched since they can't harm existing Elisp code.

When decompiling Klambda to Elisp we need functions that prefix the appropriate
symbol with ~shen/~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/prefix-symbol (X)
    (if (shen/symbol-p X)
        (intern (concat shen/prefix (symbol-name X)))
      X))
#+END_SRC

, detect if it has already has a prefixed:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/symbol-prefixed-p (X)
    (and (shen/symbol-p X) (string-prefix-p shen/prefix (symbol-name X))))
#+END_SRC

, and removes the prefix it for consumption by Shen:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/unprefix-symbol (X)
    (if (shen/internal/symbol-prefixed-p X)
        (intern (substring (symbol-name X) (length shen/prefix)))
      X))
#+END_SRC
** Assignments
When setting and getting a variable, the name is prefixed to prevent the user from stomping over one that
already exists in the Emacs image. See [[Prefixing Utilities]] for more on how this works.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/set (X Y)
    (set (intern (concat shen/prefix (symbol-name X)))
         (let ((prefixed))
           (or  (and (symbolp Y)
                     (not (shen/internal/symbol-prefixed-p Y))
                     (progn
                       (setq prefixed (shen/internal/prefix-symbol Y))
                       (or (boundp prefixed)
                           (fboundp prefixed)))
                     prefixed)
                Y))))

  (defun shen/value (X)
    (condition-case ex
        (symbol-value (intern (concat shen/prefix (symbol-name X))))
      ('error (error (format "%s has not been assigned" X)))))
#+END_SRC
** KLambda Constants
Once [[Assignments][the assigning mechanism]] is in place the spec requires some global variables:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (shen/set '*home-directory* "")
  (shen/set '*stoutput* standard-output)
  (shen/set '*stinput* [()])
  (shen/set '*language* "Elisp")
  (shen/set '*implementation* system-configuration)
  (shen/set '*porters* "Aditya Siram")
  (shen/set '*release* emacs-version)
  (shen/set '*port* 1.7)
  (shen/set '*os* (symbol-name system-type))
#+END_SRC
