shen-elisp.html
<div id="outline-container-orgd8bb037" class="outline-4">
<h4 id="orgd8bb037"><span class="section-number-4">2.3.1</span> Prefixing Utilities</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Elisp does not have namespaces so to insulate the rest of the user's Emacs image
the primitive functions, user-defined functions and variables are prefixed with <code>shen/</code>.
Raw symbols are not touched since they can't harm existing Elisp code.
</p>

<p>
When decompiling Klambda to Elisp we need functions that prefix the appropriate
symbol with <code>shen/</code>:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/prefix-symbol</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>shen/symbol-p X<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>concat shen/prefix <span style="color: #907373;">(</span>symbol-name X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    X<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
, detect if it has already has a prefixed:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/symbol-prefixed-p</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> <span style="color: #909183;">(</span>shen/symbol-p X<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>string-prefix-p shen/prefix <span style="color: #709870;">(</span>symbol-name X<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
, and removes the prefix it for consumption by Shen:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/unprefix-symbol</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>shen/internal/symbol-prefixed-p X<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>substring <span style="color: #907373;">(</span>symbol-name X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>length shen/prefix<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    X<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf703c38" class="outline-3">
<h3 id="orgf703c38"><span class="section-number-3">2.4</span> Assignments</h3>
<div class="outline-text-3" id="text-2-4">
<p>
When setting and getting a variable, the name is prefixed to prevent the user from stomping over one that
already exists in the Emacs image. See <a href="#orgd8bb037">2.3.1</a> for more on how this works.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/set</span> <span style="color: #7388D6;">(</span>X Y<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>set <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>concat shen/prefix <span style="color: #907373;">(</span>symbol-name X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>prefixed<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #0000FF;">or</span>  <span style="color: #907373;">(</span><span style="color: #0000FF;">and</span> <span style="color: #6276BA;">(</span>symbolp Y<span style="color: #6276BA;">)</span>
                   <span style="color: #6276BA;">(</span>not <span style="color: #858580;">(</span>shen/internal/symbol-prefixed-p Y<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                   <span style="color: #6276BA;">(</span><span style="color: #0000FF;">progn</span>
                     <span style="color: #858580;">(</span><span style="color: #0000FF;">setq</span> prefixed <span style="color: #80A880;">(</span>shen/internal/prefix-symbol Y<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                     <span style="color: #858580;">(</span><span style="color: #0000FF;">or</span> <span style="color: #80A880;">(</span>boundp prefixed<span style="color: #80A880;">)</span>
                         <span style="color: #80A880;">(</span>fboundp prefixed<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                   prefixed<span style="color: #907373;">)</span>
              Y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/value</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">condition-case</span> ex
      <span style="color: #909183;">(</span>symbol-value <span style="color: #709870;">(</span>intern <span style="color: #907373;">(</span>concat shen/prefix <span style="color: #6276BA;">(</span>symbol-name X<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>'error <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #008000;">"%s has not been assigned"</span> X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4653727" class="outline-3">
<h3 id="org4653727"><span class="section-number-3">2.5</span> KLambda Constants</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Once <a href="#orgf703c38">the assigning mechanism</a> is in place the spec requires some global variables:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span>shen/set '*home-directory* <span style="color: #008000;">""</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*stoutput* standard-output<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*stinput* <span style="color: #7388D6;">[</span><span style="color: #909183;">()</span><span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*language* <span style="color: #008000;">"Elisp"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*implementation* <span style="color: #008000;">"Elisp"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*porters* <span style="color: #008000;">"Aditya Siram"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*release* <span style="color: #008000;">"0.0.0.1"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*port* <span style="color: #D0372D;">1.7</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*os* <span style="color: #008000;">"Linux"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
