shen-elisp.org
** Boolean Operations
Unlike Elisp in KLambda booleans are ~false~ and ~true~, distinct symbols which
are not synonymous with ~nil~ and ~(not nil)~ so wrappers are required:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/internal/shen->predicate (X)
    (eq X 'true))
  (defsubst shen/internal/predicate->shen (X)
    (if X (quote true) (quote false)))
#+END_SRC

Since ~if~ , ~and~ and ~or~ are special forms they are defined as macros to
preserve evaluation order.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/if (X Y Z)
    `(if (eq ,X 'true) ,Y ,Z))
  (defmacro shen/and (X Y) `(shen/internal/predicate->shen (and (eq ,X 'true) (eq ,Y 'true))))
  (defmacro shen/or (X Y) `(shen/internal/predicate->shen (or (eq ,X 'true) (eq ,Y 'true))))
#+END_SRC

KLambda's ~cond~, unlike Elisp's forbids a fallthrough case - one of the
predicates must be true.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/cond (&rest CASES)
    (let* ((predicates-quoted-cases
            (mapcar (lambda (predicate-result-pair)
                      (list (if (shen/symbol-p (nth 0 predicate-result-pair))
                                (list 'quote (nth 0 predicate-result-pair))
                              (list 'shen/internal/shen->predicate (nth 0 predicate-result-pair)))
                            (nth 1 predicate-result-pair)))
                    CASES))
           (fallthrough-added (append predicates-quoted-cases (list '(t (error "One of the cond predicates must be true."))))))
      `(cond ,@fallthrough-added)))
#+END_SRC
** Lambdas
Since Shen supports currying by default KLambda's ~lambda~ form is stripped down to only accept one
argument.
#+BEGIN_SRC elisp
(lambda X (...))
#+END_SRC

Multiple arguments are supported via nesting:
#+BEGIN_SRC elisp
(lambda X (lambda Y (...)))
#+END_SRC

The implementation delegates to Elisp's ~lambda~ form:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/lambda (X Y)
    (if (eq X nil)
        `(lambda () ,Y)
      `(lambda (,X) ,Y)))
#+END_SRC
** Lets
KLambda's ~let~ in a similar way only takes one assignment:
#+BEGIN_SRC elisp
(let X Y ...)
#+END_SRC

Similarly multiple assignments are supported via nested ~lets~:
#+BEGIN_EXAMPLE elisp
(let W X (let Y Z ...))
#+END_EXAMPLE

The implementation delegates to Elisp's ~let~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/let (X Y Z)
    `(let ((,X ,Y)) ,Z))
#+END_SRC

** Defuns
The structure of ~defun~ in KLambda is identical to Elisp's so a straight
translation works.

Functions are required to be tail-call optimized but that is done below
before the body is spliced in.

#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/defun (F Args Body) `(defun ,F ,Args ,Body))
#+END_SRC

