shen-elisp.html
<div id="outline-container-orgc519f8d" class="outline-3">
<h3 id="orgc519f8d"><span class="section-number-3">2.6</span> Boolean Operations</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Unlike Elisp in KLambda booleans are <code>false</code> and <code>true</code>, distinct symbols which
are not synonymous with <code>nil</code> and <code>(not nil)</code> so wrappers are required:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/internal/shen-&gt;predicate</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>eq X 'true<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/internal/predicate-&gt;shen</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> X <span style="color: #909183;">(</span><span style="color: #0000FF;">quote</span> true<span style="color: #909183;">)</span> <span style="color: #909183;">(</span><span style="color: #0000FF;">quote</span> false<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Since <code>if</code> , <code>and</code> and <code>or</code> are special forms they are defined as macros to
preserve evaluation order.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/if</span> <span style="color: #7388D6;">(</span>X Y Z<span style="color: #7388D6;">)</span>
  `<span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>eq ,X 'true<span style="color: #909183;">)</span> ,Y ,Z<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/and</span> <span style="color: #7388D6;">(</span>X Y<span style="color: #7388D6;">)</span> `<span style="color: #7388D6;">(</span>shen/internal/predicate-&gt;shen <span style="color: #909183;">(</span><span style="color: #0000FF;">and</span> <span style="color: #709870;">(</span>eq ,X 'true<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq ,Y 'true<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/or</span> <span style="color: #7388D6;">(</span>X Y<span style="color: #7388D6;">)</span> `<span style="color: #7388D6;">(</span>shen/internal/predicate-&gt;shen <span style="color: #909183;">(</span><span style="color: #0000FF;">or</span> <span style="color: #709870;">(</span>eq ,X 'true<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq ,Y 'true<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
KLambda's <code>cond</code>, unlike Elisp's forbids a fallthrough case - one of the
predicates must be true.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/cond</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">&amp;rest</span> CASES<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>predicates-quoted-cases
          <span style="color: #907373;">(</span>mapcar <span style="color: #6276BA;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #858580;">(</span>predicate-result-pair<span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span>list <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span>shen/symbol-p <span style="color: #707183;">(</span>nth <span style="color: #D0372D;">0</span> predicate-result-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>list 'quote <span style="color: #707183;">(</span>nth <span style="color: #D0372D;">0</span> predicate-result-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                            <span style="color: #887070;">(</span>list 'shen/internal/shen-&gt;predicate <span style="color: #707183;">(</span>nth <span style="color: #D0372D;">0</span> predicate-result-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                          <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">1</span> predicate-result-pair<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                  CASES<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>fallthrough-added <span style="color: #907373;">(</span>append predicates-quoted-cases <span style="color: #6276BA;">(</span>list '<span style="color: #858580;">(</span>t <span style="color: #80A880;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"One of the cond predicates must be true."</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    `<span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span> ,@fallthrough-added<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae0d3ce" class="outline-3">
<h3 id="orgae0d3ce"><span class="section-number-3">2.7</span> Lambdas</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Since Shen supports currying by default KLambda's <code>lambda</code> form is stripped down to only accept one
argument.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">lambda</span> X <span style="color: #7388D6;">(</span>...<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Multiple arguments are supported via nesting:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">lambda</span> X <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> Y <span style="color: #909183;">(</span>...<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The implementation delegates to Elisp's <code>lambda</code> form:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/lambda</span> <span style="color: #7388D6;">(</span>X Y<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>eq X nil<span style="color: #909183;">)</span>
      `<span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">()</span> ,Y<span style="color: #909183;">)</span>
    `<span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>,X<span style="color: #709870;">)</span> ,Y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc47851" class="outline-3">
<h3 id="orgcc47851"><span class="section-number-3">2.8</span> Lets</h3>
<div class="outline-text-3" id="text-2-8">
<p>
KLambda's <code>let</code> in a similar way only takes one assignment:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">let</span> X Y ...<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Similarly multiple assignments are supported via nested <code>lets</code>:
</p>
<pre class="example">
(let W X (let Y Z ...))
</pre>

<p>
The implementation delegates to Elisp's <code>let</code>:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/let</span> <span style="color: #7388D6;">(</span>X Y Z<span style="color: #7388D6;">)</span>
  `<span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>,X ,Y<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,Z<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ea342a" class="outline-3">
<h3 id="org3ea342a"><span class="section-number-3">2.9</span> Defuns</h3>
<div class="outline-text-3" id="text-2-9">
<p>
The structure of <code>defun</code> in KLambda is identical to Elisp's so a straight
translation works.
</p>

<p>
Functions are required to be tail-call optimized but that is done below
before the body is spliced in.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/defun</span> <span style="color: #7388D6;">(</span>F Args Body<span style="color: #7388D6;">)</span> `<span style="color: #7388D6;">(</span><span style="color: #0000FF;">defun</span> ,F ,Args ,Body<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
