shen-elisp.org
** Equality
Using [[Vectors][hash-tables for tuples and vectors]] complicates equality. It also slows
down equality tests across the board but using hash-tables still results in
a substantial net-gain.

In the case of [[(strings-and-numbers)][strings and numbers]] using built-in functions suffices but for
compound structures which might contain hash-tables simply using ~(equal ...)~
will not work because two hash-tables containing the same keys and values are not
~equal~.

While ~(equal ...)~ isn't sufficient, it does have the nice property of being
right when it returns true. Two structures which are ~(equal ...)~ are equal but
~(equal ...)~ returning nil does not mean they are unequal. So we first try the
[[(obvious-equality-test)][obvious equality test]] and only perform the expensive tests when that fails.

If both arguments are cons lists and the equality check has failed it might be
that they contain hash tables so we need to check for that. First ensure they
are the same length. Note that we use ~safe-length~ and not ~length~. Only the
former is robust to lists that end in dotted pairs, eg. ~'(a b c . d)~ which are
sometimes generated from KLambda code.

Then we loop through the elements of the list ensuring that the [[(elements are of the same type)][elements are of the same type]] ,
or [[(store the inner list)][storing inner lists]] as we encounter then or recursing to
[[(compare the elements)]]. Note that even though we recur there is no risk of
blowing stack because only list comparison recurses and by this point we have
ensured that the elements are not lists.

One might wonder why we're using ~(string= ...)~ to [[(compare hash tables)]]. The
unsatisfying answer is that it was about 30% faster than whatever I could cook
up in Elisp.
#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
  (defun shen/internal/= (X Y)
    (cond ((and (stringp X) (stringp Y)) (string-equal X Y))  ;;; (ref:strings-and-numbers)
          ((and (numberp X) (numberp Y)) (= X Y))
          ((and (symbolp X) (symbolp Y)) (eq X Y))
          (t
           (or (equal X Y) ;;; (ref:obvious-equality-test)
               (cond
                ((and (consp X) (consp Y))
                 (let ((LengthX (safe-length X))
                       (LengthY (safe-length Y)))
                   (and
                    (= LengthX LengthY)
                    (let ((SoFar 't)
                          (InnerListsX (list X))
                          (InnerListsY (list Y))
                          (FirstTime 't)
                          (CurrentIndex 0))
                      (while (and SoFar InnerListsX InnerListsY)
                        (let* ((CurrentListX (pop InnerListsX))
                               (CurrentListY (pop InnerListsY))
                               (Iterate
                                (lambda ()
                                  (let ((I 0))
                                    (while (and SoFar (< I LengthX))
                                      (let* ((CurrentX (nth I CurrentListX))
                                             (CurrentY (nth I CurrentListY)))
                                        (cond
                                         ((not (equal (type-of CurrentX) (type-of CurrentY))) ;;; (ref:elements are of the same type)
                                          (setq SoFar nil))
                                         ((and (consp CurrentX) (consp CurrentY)) ;;; (ref:store the inner list)
                                          (progn
                                            (push CurrentX InnerListsX)
                                            (push CurrentY InnerListsY)))
                                         (t (setq SoFar (shen/internal/= CurrentX CurrentY)))) ;;; (ref:compare the elements)
                                        (setq I (1+ I))))))))
                          (if (not FirstTime)
                              (progn
                                (setq FirstTime nil)
                                (setq LengthX (safe-length CurrentListX))
                                (setq LengthY (safe-length CurrentListY))
                                (setq SoFar (= LengthX LengthY))
                                (funcall Iterate))
                            (funcall Iterate))))
                      SoFar))))
                ((and (hash-table-p X) (hash-table-p Y)) ;;; (ref:compare hash tables)
                 (and (= (hash-table-count X) (hash-table-count Y))
                      (string=  ;;; (ref:hash table comparison)
                       (prin1-to-string X)
                       (prin1-to-string Y))))
                (t nil))))))

  (defsubst shen/= (X Y)
    (shen/internal/predicate->shen (shen/internal/= X Y)))
#+END_SRC
