shen-elisp.html

<div id="outline-container-org32d53b0" class="outline-3">
<h3 id="org32d53b0"><span class="section-number-3">2.10</span> Equality</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Using <a href="#org79fade9">hash-tables for tuples and vectors</a> complicates equality. It also slows
down equality tests across the board but using hash-tables still results in
a substantial net-gain.
</p>

<p>
In the case of <a href="#coderef-strings-and-numbers"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-strings-and-numbers');" onmouseout="CodeHighlightOff(this, 'coderef-strings-and-numbers');">strings and numbers</a> using built-in functions suffices but for
compound structures which might contain hash-tables simply using <code>(equal ...)</code>
will not work because two hash-tables containing the same keys and values are not
<code>equal</code>.
</p>

<p>
While <code>(equal ...)</code> isn't sufficient, it does have the nice property of being
right when it returns true. Two structures which are <code>(equal ...)</code> are equal but
<code>(equal ...)</code> returning nil does not mean they are unequal. So we first try the
<a href="#coderef-obvious-equality-test"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-obvious-equality-test');" onmouseout="CodeHighlightOff(this, 'coderef-obvious-equality-test');">obvious equality test</a> and only perform the expensive tests when that fails.
</p>

<p>
If both arguments are cons lists and the equality check has failed it might be
that they contain hash tables so we need to check for that. First ensure they
are the same length. Note that we use <code>safe-length</code> and not <code>length</code>. Only the
former is robust to lists that end in dotted pairs, eg. <code>'(a b c . d)</code> which are
sometimes generated from KLambda code.
</p>

<p>
Then we loop through the elements of the list ensuring that the <a href="#coderef-elements are of the same type"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-elements are of the same type');" onmouseout="CodeHighlightOff(this, 'coderef-elements are of the same type');">elements are of the same type</a> , or <a href="#coderef-store the inner list"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-store the inner list');" onmouseout="CodeHighlightOff(this, 'coderef-store the inner list');">storing inner lists</a> as we encounter then or recursing to
<a href="#coderef-compare the elements"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compare the elements');" onmouseout="CodeHighlightOff(this, 'coderef-compare the elements');">compare the elements</a>. Note that even though we recur there is no risk of
blowing stack because only list comparison recurses and by this point we have
ensured that the elements are not lists.
</p>

<p>
One might wonder why we're using <code>(string= ...)</code> to <a href="#coderef-compare hash tables"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compare hash tables');" onmouseout="CodeHighlightOff(this, 'coderef-compare hash tables');">compare hash tables</a>. The
unsatisfying answer is that it was about 30% faster than whatever I could cook
up in Elisp.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/=</span> <span style="color: #7388D6;">(</span>X Y<span style="color: #7388D6;">)</span>
<span id="coderef-strings-and-numbers" class="coderef-off">  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>stringp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>stringp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>string-equal X Y<span style="color: #709870;">)</span><span style="color: #909183;">)</span>  <span style="color: #8D8D84;">;;;</span> (strings-and-numbers)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>numberp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>numberp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>= X Y<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>symbolp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>symbolp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq X Y<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>t
<span id="coderef-obvious-equality-test" class="coderef-off">         <span style="color: #709870;">(</span><span style="color: #0000FF;">or</span> <span style="color: #907373;">(</span>equal X Y<span style="color: #907373;">)</span> <span style="color: #8D8D84;">;;;</span> (obvious-equality-test)</span>
             <span style="color: #907373;">(</span><span style="color: #0000FF;">cond</span>
              <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span><span style="color: #0000FF;">and</span> <span style="color: #80A880;">(</span>consp X<span style="color: #80A880;">)</span> <span style="color: #80A880;">(</span>consp Y<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span><span style="color: #0000FF;">let</span> <span style="color: #80A880;">(</span><span style="color: #887070;">(</span>LengthX <span style="color: #707183;">(</span>safe-length X<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                     <span style="color: #887070;">(</span>LengthY <span style="color: #707183;">(</span>safe-length Y<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                 <span style="color: #80A880;">(</span><span style="color: #0000FF;">and</span>
                  <span style="color: #887070;">(</span>= LengthX LengthY<span style="color: #887070;">)</span>
                  <span style="color: #887070;">(</span><span style="color: #0000FF;">let</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>SoFar 't<span style="color: #7388D6;">)</span>
                        <span style="color: #7388D6;">(</span>InnerListsX <span style="color: #909183;">(</span>list X<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                        <span style="color: #7388D6;">(</span>InnerListsY <span style="color: #909183;">(</span>list Y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                        <span style="color: #7388D6;">(</span>FirstTime 't<span style="color: #7388D6;">)</span>
                        <span style="color: #7388D6;">(</span>CurrentIndex <span style="color: #D0372D;">0</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                    <span style="color: #707183;">(</span><span style="color: #0000FF;">while</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> SoFar InnerListsX InnerListsY<span style="color: #7388D6;">)</span>
                      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>CurrentListX <span style="color: #907373;">(</span><span style="color: #0000FF;">pop</span> InnerListsX<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                             <span style="color: #709870;">(</span>CurrentListY <span style="color: #907373;">(</span><span style="color: #0000FF;">pop</span> InnerListsY<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                             <span style="color: #709870;">(</span>Iterate
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">()</span>
                                <span style="color: #6276BA;">(</span><span style="color: #0000FF;">let</span> <span style="color: #858580;">(</span><span style="color: #80A880;">(</span>I <span style="color: #D0372D;">0</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                  <span style="color: #858580;">(</span><span style="color: #0000FF;">while</span> <span style="color: #80A880;">(</span><span style="color: #0000FF;">and</span> SoFar <span style="color: #887070;">(</span>&lt; I LengthX<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                    <span style="color: #80A880;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>CurrentX <span style="color: #7388D6;">(</span>nth I CurrentListX<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                                           <span style="color: #707183;">(</span>CurrentY <span style="color: #7388D6;">(</span>nth I CurrentListY<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                      <span style="color: #887070;">(</span><span style="color: #0000FF;">cond</span>
<span id="coderef-elements are of the same type" class="coderef-off">                                       <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>not <span style="color: #909183;">(</span>equal <span style="color: #709870;">(</span>type-of CurrentX<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>type-of CurrentY<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> <span style="color: #8D8D84;">;;;</span> (elements are of the same type)</span>
                                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> SoFar nil<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span id="coderef-store the inner list" class="coderef-off">                                       <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> <span style="color: #909183;">(</span>consp CurrentX<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>consp CurrentY<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> <span style="color: #8D8D84;">;;;</span> (store the inner list)</span>
                                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">progn</span>
                                          <span style="color: #909183;">(</span><span style="color: #0000FF;">push</span> CurrentX InnerListsX<span style="color: #909183;">)</span>
                                          <span style="color: #909183;">(</span><span style="color: #0000FF;">push</span> CurrentY InnerListsY<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span id="coderef-compare the elements" class="coderef-off">                                       <span style="color: #707183;">(</span>t <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> SoFar <span style="color: #909183;">(</span>shen/internal/= CurrentX CurrentY<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span> <span style="color: #8D8D84;">;;;</span> (compare the elements)</span>
                                      <span style="color: #887070;">(</span><span style="color: #0000FF;">setq</span> I <span style="color: #707183;">(</span>1+ I<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                        <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>not FirstTime<span style="color: #709870;">)</span>
                            <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> FirstTime nil<span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> LengthX <span style="color: #6276BA;">(</span>safe-length CurrentListX<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> LengthY <span style="color: #6276BA;">(</span>safe-length CurrentListY<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> SoFar <span style="color: #6276BA;">(</span>= LengthX LengthY<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span>funcall Iterate<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                          <span style="color: #709870;">(</span>funcall Iterate<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                    SoFar<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
<span id="coderef-compare hash tables" class="coderef-off">              <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span><span style="color: #0000FF;">and</span> <span style="color: #80A880;">(</span>hash-table-p X<span style="color: #80A880;">)</span> <span style="color: #80A880;">(</span>hash-table-p Y<span style="color: #80A880;">)</span><span style="color: #858580;">)</span> <span style="color: #8D8D84;">;;;</span> (compare hash tables)</span>
               <span style="color: #858580;">(</span><span style="color: #0000FF;">and</span> <span style="color: #80A880;">(</span>= <span style="color: #887070;">(</span>hash-table-count X<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>hash-table-count Y<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
<span id="coderef-hash table comparison" class="coderef-off">                    <span style="color: #80A880;">(</span>string=  <span style="color: #8D8D84;">;;;</span> (hash table comparison)</span>
                     <span style="color: #887070;">(</span>prin1-to-string X<span style="color: #887070;">)</span>
                     <span style="color: #887070;">(</span>prin1-to-string Y<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
              <span style="color: #6276BA;">(</span>t nil<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/=</span> <span style="color: #7388D6;">(</span>X Y<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/predicate-&gt;shen <span style="color: #909183;">(</span>shen/internal/= X Y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
