shen-elisp.org
** Other Generic Functions
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/freeze (X)
    `(function (lambda nil ,X)))
  (defsubst shen/type (X MyType) (declare (ignore MyType)) X)
#+END_SRC

** Lists
List construction in KLambda is done with ~cons~ exclusively. The KLambda list
~[ a b c ]~ for example is constructed:
#+BEGIN_EXAMPLE
(cons a (cons b (cons c ())))
#+END_EXAMPLE

Elisp also provides a ~cons~ so a straightforward translation is possible *but*
it blows the recursion stack after a certain number of elements. They are [[Consolidate Cons][rewritten]] to
~list~ calls below but a ~cons~ is provided to adhere to the standard:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/cons (A Rest)
    (cons A Rest))
#+END_SRC

The rest of the list operations function as expected:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/hd (List)    (car List))
  (defsubst shen/tl (List)    (cdr List))
  (defsubst shen/cons? (List) (shen/internal/predicate->shen (consp List)))
#+END_SRC
** Strings
- Printing KLambda datatypes.

  The only weirdness here is why we print the ~buffer-name~
  of a stream. That is explained in the [[Streams and I/O]].:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/str (X)
    (cond ((null X) (error "null is not an atom in Shen; str cannot convert it to a string.~%"))
          ((or (symbolp X) (functionp X)) (symbol-name X))
          ((numberp X) (number-to-string X))
          ((stringp X) X)
          ((and (bufferp X) (buffer-file-name X)) (buffer-name X))
          ((eq X standard-input) "standard-input")
          ((eq X standard-output) "standard-output")
          (t
           (error (format "%s is not an atom, stream or closure; str cannot convert it to a string." X)))))
#+END_SRC
- Given string ~S~ get the character at index ~N~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/pos (S N) (string (aref S N)))
#+END_SRC

- Get the rest of a non-empty string:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/tlstr (X) (substring X 1))
#+END_SRC

- Test for a string, join them and convert between characters and strings:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/string? (S) (shen/internal/predicate->shen (stringp S)))
  (defsubst shen/cn (Str1 Str2) (concat Str1 Str2))
  (defsubst shen/n->string (N) (string N))
  (defsubst shen/string->n (S) (string-to-char S))
#+END_SRC

NOTE: If a non-empty string is converted to a character only the first character
of the string is considered.
** Error Handling
Elisp's ~error~ and ~condition-case~ covers the primitive error handling
required by the spec:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (define-error 'shen/error "Shen error" 'error)
  (defsubst shen/simple-error (E)
    (signal 'shen/error
            (if (stringp E)
                (list E)
              E)))
  (defmacro shen/trap-error (X F)
    `(condition-case ex ,X ('error (funcall ,F ex))))
  (defsubst shen/error-to-string (E) (format "%s" E))
#+END_SRC
