shen-elisp.html
<div id="outline-container-orga46275c" class="outline-3">
<h3 id="orga46275c"><span class="section-number-3">2.11</span> Other Generic Functions</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/freeze</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  `<span style="color: #7388D6;">(</span><span style="color: #0000FF;">function</span> <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> nil ,X<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/type</span> <span style="color: #7388D6;">(</span>X MyType<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">declare</span> <span style="color: #909183;">(</span>ignore MyType<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> X<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc69bed8" class="outline-3">
<h3 id="orgc69bed8"><span class="section-number-3">2.12</span> Lists</h3>
<div class="outline-text-3" id="text-2-12">
<p>
List construction in KLambda is done with <code>cons</code> exclusively. The KLambda list
<code>[ a b c ]</code> for example is constructed:
</p>
<pre class="example">
(cons a (cons b (cons c ())))
</pre>

<p>
Elisp also provides a <code>cons</code> so a straightforward translation is possible <b>but</b>
it blows the recursion stack after a certain number of elements. They are <a href="#org29f34f3">rewritten</a> to
<code>list</code> calls below but a <code>cons</code> is provided to adhere to the standard:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/cons</span> <span style="color: #7388D6;">(</span>A Rest<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>cons A Rest<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The rest of the list operations function as expected:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/hd</span> <span style="color: #7388D6;">(</span>List<span style="color: #7388D6;">)</span>    <span style="color: #7388D6;">(</span>car List<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/tl</span> <span style="color: #7388D6;">(</span>List<span style="color: #7388D6;">)</span>    <span style="color: #7388D6;">(</span>cdr List<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/cons?</span> <span style="color: #7388D6;">(</span>List<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>shen/internal/predicate-&gt;shen <span style="color: #909183;">(</span>consp List<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbcfdd2a" class="outline-3">
<h3 id="orgbcfdd2a"><span class="section-number-3">2.13</span> Strings</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li><p>
Printing KLambda datatypes.
</p>

<p>
The only weirdness here is why we print the <code>buffer-name</code>
of a stream. That is explained in the <a href="#orgf023406">2.18</a>.:
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/str</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>null X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"null is not an atom in Shen; str cannot convert it to a string.~%"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #0000FF;">or</span> <span style="color: #907373;">(</span>symbolp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>functionp X<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>symbol-name X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>numberp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>number-to-string X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>stringp X<span style="color: #709870;">)</span> X<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>bufferp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>buffer-file-name X<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>buffer-name X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eq X standard-input<span style="color: #709870;">)</span> <span style="color: #008000;">"standard-input"</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eq X standard-output<span style="color: #709870;">)</span> <span style="color: #008000;">"standard-output"</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>t
         <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #008000;">"%s is not an atom, stream or closure; str cannot convert it to a string."</span> X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Given string <code>S</code> get the character at index <code>N</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/pos</span> <span style="color: #7388D6;">(</span>S N<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>string <span style="color: #909183;">(</span>aref S N<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Get the rest of a non-empty string:</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/tlstr</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>substring X <span style="color: #D0372D;">1</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Test for a string, join them and convert between characters and strings:</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/string?</span> <span style="color: #7388D6;">(</span>S<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>shen/internal/predicate-&gt;shen <span style="color: #909183;">(</span>stringp S<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/cn</span> <span style="color: #7388D6;">(</span>Str1 Str2<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>concat Str1 Str2<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/n-&gt;string</span> <span style="color: #7388D6;">(</span>N<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>string N<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/string-&gt;n</span> <span style="color: #7388D6;">(</span>S<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>string-to-char S<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
NOTE: If a non-empty string is converted to a character only the first character
of the string is considered.
</p>
</div>
</div>
<div id="outline-container-org32d5bd2" class="outline-3">
<h3 id="org32d5bd2"><span class="section-number-3">2.14</span> Error Handling</h3>
<div class="outline-text-3" id="text-2-14">
<p>
Elisp's <code>error</code> and <code>condition-case</code> covers the primitive error handling
required by the spec:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span>define-error 'shen/error <span style="color: #008000;">"Shen error"</span> 'error<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/simple-error</span> <span style="color: #7388D6;">(</span>E<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> 'shen/error
          <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>stringp E<span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>list E<span style="color: #709870;">)</span>
            E<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">shen/trap-error</span> <span style="color: #7388D6;">(</span>X F<span style="color: #7388D6;">)</span>
  `<span style="color: #7388D6;">(</span><span style="color: #0000FF;">condition-case</span> ex ,X <span style="color: #909183;">(</span>'error <span style="color: #709870;">(</span>funcall ,F ex<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/error-to-string</span> <span style="color: #7388D6;">(</span>E<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>format <span style="color: #008000;">"%s"</span> E<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
