shen-elisp.org
** Vectors
Hash tables are used to represent Klambda vectors. This is counter-intuitive
since Elisp does have native vectors but unfortunately they are not resizable.
Since KLambda code tends to allocate huge vectors and resize often, switching
from vectors to hash-tables where resizing is natively supported led to 4-5x
speed-ups across the board.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/absvector (N) (make-hash-table :size N :rehash-size 3.0 :test 'shen/internal/hash-table-test))
  (defsubst shen/address-> (Vector N Value) (progn (puthash N Value Vector) Vector))
  (defsubst shen/<-address (Vector N) (gethash N Vector))
  (defsubst shen/absvector? (X) (shen/internal/predicate->shen (hash-table-p X)))
#+END_SRC

While using hash-tables for Shen vectors, tuples and property lists do offer a
significant speed-ups there is an ugly downside: if any of those structures are
used as keys, lookups will fail because in Elisp two hash-tables do not hash to
the same number and so using ~(make-hash-table ... :test 'equal)~ does not work.
So we roll our own test which delegates to ~shen/internal/=~ for testing equality
and only generates a hash for these structures using only their keys and values.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (define-hash-table-test
    'shen/internal/hash-table-test
    (lambda (X Y)
      (shen/internal/= X Y))
    (lambda (X)
      (cond
       ((numberp X) X)
       ((consp X) (sxhash (prin1-to-string X)))
       ((hash-table-p X)
        (sxhash (prin1-to-string X)))
       (t (sxhash X)))))
#+END_SRC
