shen-elisp.html
<div id="outline-container-org79fade9" class="outline-3">
<h3 id="org79fade9"><span class="section-number-3">2.15</span> Vectors</h3>
<div class="outline-text-3" id="text-2-15">
<p>
Hash tables are used to represent Klambda vectors. This is counter-intuitive
since Elisp does have native vectors but unfortunately they are not resizable.
Since KLambda code tends to allocate huge vectors and resize often, switching
from vectors to hash-tables where resizing is natively supported led to 4-5x
speed-ups across the board.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/absvector</span> <span style="color: #7388D6;">(</span>N<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>make-hash-table <span style="color: #006FE0;">:size</span> N <span style="color: #006FE0;">:rehash-size</span> <span style="color: #D0372D;">3.0</span> <span style="color: #006FE0;">:test</span> 'shen/internal/hash-table-test<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/address-&gt;</span> <span style="color: #7388D6;">(</span>Vector N Value<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">progn</span> <span style="color: #909183;">(</span>puthash N Value Vector<span style="color: #909183;">)</span> Vector<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/&lt;-address</span> <span style="color: #7388D6;">(</span>Vector N<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>gethash N Vector<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/absvector?</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>shen/internal/predicate-&gt;shen <span style="color: #909183;">(</span>hash-table-p X<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
While using hash-tables for Shen vectors, tuples and property lists do offer a
significant speed-ups there is an ugly downside: if any of those structures are
used as keys, lookups will fail because in Elisp two hash-tables do not hash to
the same number and so using <code>(make-hash-table ... :test 'equal)</code> does not work.
So we roll our own test which delegates to <code>shen/internal/=</code> for testing equality
and only generates a hash for these structures using only their keys and values.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span>define-hash-table-test
  'shen/internal/hash-table-test
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>X Y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/internal/= X Y<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>X<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>numberp X<span style="color: #907373;">)</span> X<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>consp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>sxhash <span style="color: #6276BA;">(</span>prin1-to-string X<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>hash-table-p X<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>sxhash <span style="color: #6276BA;">(</span>prin1-to-string X<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>t <span style="color: #907373;">(</span>sxhash X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
