shen-elisp.org
** Arithmetic Operations
In KLambda there is only ~number~ so we have to take care to coerce to between ~float~ and
~integer~ as necessary.

Most of this code is heavily borrowed from [[https://github.com/larsbrinkhoff/emacs-cl/blob/master/src/cl-numbers.el][emacs-cl]] but simplified since Shen does not have
the zoo of numeric types supported by CL.

First a couple of limits to detect when a multiplication or addition might exceed the bounds
of an ~integer~,
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defconst shen/multiplication-limit (floor (sqrt most-positive-fixnum)))
  (defconst shen/addition-limit (floor (/ most-positive-fixnum 2)))
#+END_SRC

a generic function to coerce to a float if necessary,
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/number-op (X Y max op)
    (cond
     ((and (integerp X) (integerp Y))
      (if (and (< X max)
               (> X (- max))
               (< Y max)
               (> Y (- max)))
          (apply op (list X Y))
        (apply op (list (float X) (float Y)))))
     ((and (floatp X) (numberp Y)) (apply op (list X (float Y))))
     ((and (numberp X) (floatp Y)) (apply op (list (float X) Y)))
     (t (error (format "Trying to %s. Both %s and %s must be numbers" op X Y)))))
#+END_SRC

and the standard arithmetic functions.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/* (X Y) (shen/number-op X Y shen/multiplication-limit #'*))
  (defsubst shen/+ (X Y) (shen/number-op X Y shen/addition-limit #'+))
  (defsubst shen/- (X Y) (shen/number-op X Y shen/addition-limit #'-))
#+END_SRC

When we divide we leave the result an integer if we can:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen// (X Y)
    (cond
     ((or (not (numberp X)) (not (numberp Y)))
      (error (format "Both %s and %s must be numbers." X Y)))
     ((and (integerp X) (integerp Y))
      (let* ((Div (/ (float X) (float Y)))
             (Truncated (floor Div)))
        (if (= Truncated Div)
            Truncated
          Div)))
     (t (/ (float X) (float Y)))))
#+END_SRC

And finally the standard number predicates are pretty compatible with Elisp so we just
wrap the Elisp functions:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/> (X Y)     (shen/internal/predicate->shen (> X Y)))
  (defsubst shen/< (X Y)     (shen/internal/predicate->shen (< X Y)))
  (defsubst shen/>= (X Y)    (shen/internal/predicate->shen (>= X Y)))
  (defsubst shen/<= (X Y)    (shen/internal/predicate->shen (<= X Y)))
  (defsubst shen/number? (N) (shen/internal/predicate->shen (numberp N)))
#+END_SRC

