shen-elisp.org
** Time
The ~get-time~ primitive given ~real~ or ~unix~ returns the current Unix time
(seconds since Jan 1st 1970) and given ~run~ returns the CPU time according to
Emacs.

Both Emacs functions ~get-internal-run-time~ and ~current-time~ return a 32-bit
number as a tuple where the first is the 16 high bits and the second is the 16
lower bits. To put them together we normalize the high bits by multiplying them
with 2^16 and add the result to the lower bits.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defconst shen/2^16 65536)
  (defun shen/get-time (Time)
    (cl-flet
        ((timespec-to-number (spec)
                             (let* ((high (nth 0 spec))
                                    (low (nth 1 spec)))
                               (+ (* high shen/2^16) low))))
      (cond ((eq Time 'run) (timespec-to-number (get-internal-run-time)))
            ((eq Time 'real)(timespec-to-number (current-time)))
            ((eq Time 'unix)(timespec-to-number (current-time)))
            (t (error (format "get-time does not understand parameter %s." Time))))))
#+END_SRC
