shen-elisp.html

<div id="outline-container-orgfea81be" class="outline-3">
<h3 id="orgfea81be"><span class="section-number-3">2.17</span> Time</h3>
<div class="outline-text-3" id="text-2-17">
<p>
The <code>get-time</code> primitive given <code>real</code> or <code>unix</code> returns the current Unix time
(seconds since Jan 1st 1970) and given <code>run</code> returns the CPU time according to
Emacs.
</p>

<p>
Both Emacs functions <code>get-internal-run-time</code> and <code>current-time</code> return a 32-bit
number as a tuple where the first is the 16 high bits and the second is the 16
lower bits. To put them together we normalize the high bits by multiplying them
with 2^16 and add the result to the lower bits.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defconst</span> <span style="color: #BA36A5;">shen/2^16</span> <span style="color: #D0372D;">65536</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/get-time</span> <span style="color: #7388D6;">(</span>Time<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">cl-flet</span>
      <span style="color: #909183;">(</span><span style="color: #709870;">(</span>timespec-to-number <span style="color: #907373;">(</span>spec<span style="color: #907373;">)</span>
                           <span style="color: #907373;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>high <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">0</span> spec<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                  <span style="color: #858580;">(</span>low <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">1</span> spec<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                             <span style="color: #6276BA;">(</span>+ <span style="color: #858580;">(</span>* high shen/2^16<span style="color: #858580;">)</span> low<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq Time 'run<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>timespec-to-number <span style="color: #6276BA;">(</span>get-internal-run-time<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq Time 'real<span style="color: #907373;">)(</span>timespec-to-number <span style="color: #6276BA;">(</span>current-time<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq Time 'unix<span style="color: #907373;">)(</span>timespec-to-number <span style="color: #6276BA;">(</span>current-time<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>t <span style="color: #907373;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #6276BA;">(</span>format <span style="color: #008000;">"get-time does not understand parameter %s."</span> Time<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
