shen-elisp.html
<div id="outline-container-orgf023406" class="outline-3">
<h3 id="orgf023406"><span class="section-number-3">2.18</span> Streams and I/O</h3>
<div class="outline-text-3" id="text-2-18">
<p>
Streams at the KLambda level are just an abstraction over file I/O. At the Elisp
level <code>X</code> is a stream if it is a buffer with an associated file. That last bit
is important, because per the spec, buffers that aren't tied to the underlying
filesystem are not streams.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defsubst</span> <span style="color: #006699;">shen/streamp</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> <span style="color: #909183;">(</span>bufferp X<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>buffer-file-name X<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Opening a stream takes a path <code>Path</code> and, per the spec, makes it relative to the
global <code>*home-directory*</code> variable. It also takes a <code>Direction</code> which is either
<code>in</code> or <code>out</code> meaning we are either reading or writing.
</p>

<p>
A file opened with <code>Direction</code> <code>in</code>, as in <code>(open some-file.txt in)</code> is
considered read-only. It must be opened with <code>Direction</code> <code>out</code>, as in <code>(open
some-file.txt out)</code> in order to be able to write to it. A read-only
file stream must be <code>close</code> -ed and re-opened <code>out</code> before it can be written.
</p>

<p>
Additionally buffers <code>open</code> -ed by Shen are "marked" with a buffer local variable
<code>shen/shen-buffer</code> to ensure that only Shen code can <code>read</code> / <code>write</code> / <code>close</code>
them. Buffers that are already open are left alone:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/open</span> <span style="color: #7388D6;">(</span>Path Direction<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>Path <span style="color: #907373;">(</span>concat <span style="color: #6276BA;">(</span>file-name-as-directory <span style="color: #858580;">(</span>shen/value '*home-directory*<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                       <span style="color: #6276BA;">(</span>file-relative-name Path<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>Buffer <span style="color: #907373;">(</span>find-buffer-visiting Path<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> Buffer
        <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">with-current-buffer</span> Buffer
            <span style="color: #6276BA;">(</span>goto-char <span style="color: #858580;">(</span>point-min<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          Buffer<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">cond</span>
       <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>equal Direction 'in<span style="color: #6276BA;">)</span>
        <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>not <span style="color: #80A880;">(</span>file-exists-p Path<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #80A880;">(</span>format <span style="color: #008000;">"Path does not exist: %s"</span> Path<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #0000FF;">progn</span>
            <span style="color: #80A880;">(</span><span style="color: #0000FF;">setq</span> Buffer <span style="color: #887070;">(</span>find-file-noselect Path<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
            <span style="color: #80A880;">(</span><span style="color: #0000FF;">with-current-buffer</span>
                Buffer
              <span style="color: #887070;">(</span><span style="color: #0000FF;">progn</span>
                <span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> buffer-read-only 't<span style="color: #707183;">)</span>
                <span style="color: #707183;">(</span><span style="color: #0000FF;">setq-local</span> shen/shen-buffer 't<span style="color: #707183;">)</span>
                <span style="color: #707183;">(</span>goto-char <span style="color: #7388D6;">(</span>point-min<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
            Buffer<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>equal Direction 'out<span style="color: #6276BA;">)</span>
        <span style="color: #6276BA;">(</span><span style="color: #0000FF;">progn</span>
          <span style="color: #858580;">(</span><span style="color: #0000FF;">setq</span> Buffer <span style="color: #80A880;">(</span>find-buffer-visiting Path<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #0000FF;">if</span> <span style="color: #80A880;">(</span>bufferp Buffer<span style="color: #80A880;">)</span>
              <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span><span style="color: #0000FF;">and</span> <span style="color: #707183;">(</span>buffer-local-value 'buffer-read-only Buffer<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>buffer-local-value 'shen/shen-buffer Buffer<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                  <span style="color: #887070;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #707183;">(</span>format  <span style="color: #008000;">"A stream to %s already open read-only. Call (close \"%s\") followed by (open \"%s\" 'out). "</span> Path Path Path<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                Buffer<span style="color: #80A880;">)</span>
            <span style="color: #80A880;">(</span><span style="color: #0000FF;">progn</span>
              <span style="color: #887070;">(</span><span style="color: #0000FF;">setq</span> Buffer <span style="color: #707183;">(</span>find-file-noselect Path<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span><span style="color: #0000FF;">with-current-buffer</span> Buffer
                <span style="color: #707183;">(</span><span style="color: #0000FF;">progn</span>
                  <span style="color: #7388D6;">(</span>goto-char <span style="color: #909183;">(</span>point-max<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq-local</span> shen/shen-buffer 't<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Before closing, reading or writing to a buffer first check that it was opened by
a Shen program.</li>
</ul>

<p>
A further bit of weirdness is that <code>write-byte</code> switches on a <a href="#coderef-write-byte-function"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-write-byte-function');" onmouseout="CodeHighlightOff(this, 'coderef-write-byte-function');">function</a>. This is because
when writing out to the <a href="#org7cf0e03">10</a> requires calling a function with the character.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/close</span> <span style="color: #7388D6;">(</span>Stream<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>not Stream<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"Stream is nil."</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>local-variable-p 'shen/shen-buffer Stream<span style="color: #907373;">)</span>
             <span style="color: #907373;">(</span>buffer-local-value 'shen/shen-buffer Stream<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>buffer-local-value 'buffer-read-only Stream<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span>kill-buffer Stream<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>t <span style="color: #6276BA;">(</span><span style="color: #0000FF;">with-current-buffer</span>
                     Stream
                   <span style="color: #858580;">(</span><span style="color: #0000FF;">progn</span>
                     <span style="color: #80A880;">(</span>write-file <span style="color: #887070;">(</span>buffer-file-name Stream<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                     <span style="color: #80A880;">(</span>kill-buffer Stream<span style="color: #80A880;">)</span>
                     '<span style="color: #80A880;">()</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/write-byte</span> <span style="color: #7388D6;">(</span>Byte <span style="color: #6434A3;">&amp;optional</span> S<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> S
      <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
       <span style="color: #709870;">(</span><span style="color: #907373;">(</span>bufferp S<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> <span style="color: #6276BA;">(</span>not <span style="color: #858580;">(</span>local-variable-p 'buffer-read-only S<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #858580;">(</span>format <span style="color: #008000;">"Buffer %s is read-only."</span> S<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>buffer-local-value 'shen/shen-buffer S<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>write-char Byte S<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #80A880;">(</span>format <span style="color: #008000;">"Buffer %s was not opened by Shen."</span> S<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
<span id="coderef-write-byte-function" class="coderef-off">       <span style="color: #709870;">(</span><span style="color: #907373;">(</span>functionp S<span style="color: #907373;">)</span> <span style="color: #8D8D84;">;;</span> (write-byte-function)</span>
        <span style="color: #907373;">(</span>funcall S Byte<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span>t <span style="color: #907373;">(</span>write-char <span style="color: #6276BA;">(</span>shen/stoutput<span style="color: #6276BA;">)</span> Byte<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>funcall <span style="color: #709870;">(</span>shen/stoutput<span style="color: #709870;">)</span> Byte<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/read-byte</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">&amp;optional</span> S<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">cond</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>bufferp S<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>buffer-file-name S<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #0000FF;">with-current-buffer</span> S
      <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>current-byte<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
        <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>eq <span style="color: #80A880;">(</span>point<span style="color: #80A880;">)</span> <span style="color: #80A880;">(</span>point-max<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #D0372D;">-1</span>
          <span style="color: #858580;">(</span><span style="color: #0000FF;">progn</span>
            <span style="color: #80A880;">(</span><span style="color: #0000FF;">setq</span> current-byte <span style="color: #887070;">(</span>get-byte<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
            <span style="color: #80A880;">(</span>forward-char<span style="color: #80A880;">)</span>
            current-byte<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>vectorp S<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>not <span style="color: #6276BA;">(</span>aref S <span style="color: #D0372D;">0</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                    <span style="color: #D0372D;">-1</span>
                  <span style="color: #907373;">(</span><span style="color: #0000FF;">pop</span> <span style="color: #6276BA;">(</span>aref S <span style="color: #D0372D;">0</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>t <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #008000;">"Unrecognized stream format %s"</span> S<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
