shen-elisp.org
* Utilities
** Lookup
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/lookup-with-default (KEY ALIST DEFAULT)
    (car (or (assoc-default KEY ALIST) (list DEFAULT))))
#+END_SRC
** AST Utilities
The next few sections are about transforming the KLambda AST so we
need a few utilites to make the job easier.
*** Paths
Paths are a way of getting or setting deep inside some tree. For the most part
they are a list of numbers . A getter to the path ~'(0 4 3)~ given an ~ast~
simply folds over the list into ~(nth 0 (nth 4 (nth 3 ast)))~.

Unfortunately the presence of dotted pairs makes the representation less
uniform. Using ~nth~ does not get and set the cdr of a dotted pair. For example,
~(nth 1 '(a . b))~ will throw an error about ~b~ not being a list. In that case
we need to use ~(nthcdr 1 '(a . b))~. The ~cdr~ of a dotted pair is represented
as a single number ~1~ inside a list, like ~'(1)~.

*** AST Getter/Setter
#+NAME: AST Getter
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/get-element-at (path ast)
    (let ((res ast))
      (dolist (current-index (reverse path) res)
        (if (listp current-index)
            (setq res (nthcdr (car current-index) res))
          (setq res (nth current-index res))))))
#+END_SRC

For the setter we use Elisp's ~setf~ which takes a ~PLACE~ expression and a
value. Given the previous example path ~(0 4 3)~ , ~(setf (nth 0 (nth 4 (nth
3 ast))) 'x)~ changes the 1st element of the 3rd element of the 2nd element to
~'x~. This function is more complex because unlike the getter we can't just
iterate down the tree, we have to /build/ the ~PLACE~ expression completely
before handing it off to ~setf~.
#+NAME: AST Setter
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/nset-element-at (path ast new-element)
    (if (not path)
        (setf ast new-element)
      (let ((place-fn)
            (path (reverse path))
            (make-place-fn
             (lambda (path target)
               (if (listp path)
                   `(nthcdr ,path ,target)
                   `(nth ,path ,target)))))
        (progn
          (dotimes (current-index (length path) nil)
            (setq place-fn
                  (funcall make-place-fn
                           (nth current-index path)
                           (if (= current-index 0)
                               'ast
                             place-fn))))
          (if (or (consp new-element) (shen/symbol-p new-element))
              (eval `(setf ,place-fn (quote ,new-element)) 't)
            (eval `(setf ,place-fn ,new-element)) 't)
          ast))))
#+END_SRC
*** AST Search
