shen-elisp.html
<div id="outline-container-orgf93b424" class="outline-2">
<h2 id="orgf93b424"><span class="section-number-2">3</span> Utilities</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgf9ca75c" class="outline-3">
<h3 id="orgf9ca75c"><span class="section-number-3">3.1</span> Lookup</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/lookup-with-default</span> <span style="color: #7388D6;">(</span>KEY ALIST DEFAULT<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>car <span style="color: #909183;">(</span><span style="color: #0000FF;">or</span> <span style="color: #709870;">(</span>assoc-default KEY ALIST<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>list DEFAULT<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d7f67d" class="outline-3">
<h3 id="org2d7f67d"><span class="section-number-3">3.2</span> AST Utilities</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The next few sections are about transforming the KLambda AST so we
need a few utilites to make the job easier.
</p>
</div>
<div id="outline-container-org1fede55" class="outline-4">
<h4 id="org1fede55"><span class="section-number-4">3.2.1</span> Paths</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Paths are a way of getting or setting deep inside some tree. For the most part
they are a list of numbers . A getter to the path <code>'(0 4 3)</code> given an <code>ast</code>
simply folds over the list into <code>(nth 0 (nth 4 (nth 3 ast)))</code>.
</p>

<p>
Unfortunately the presence of dotted pairs makes the representation less
uniform. Using <code>nth</code> does not get and set the cdr of a dotted pair. For example,
<code>(nth 1 '(a . b))</code> will throw an error about <code>b</code> not being a list. In that case
we need to use <code>(nthcdr 1 '(a . b))</code>. The <code>cdr</code> of a dotted pair is represented
as a single number <code>1</code> inside a list, like <code>'(1)</code>.
</p>
</div>
</div>

<div id="outline-container-org08564fd" class="outline-4">
<h4 id="org08564fd"><span class="section-number-4">3.2.2</span> AST Getter/Setter</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-elisp" id="org371004f"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/get-element-at</span> <span style="color: #7388D6;">(</span>path ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #709870;">(</span>current-index <span style="color: #907373;">(</span>reverse path<span style="color: #907373;">)</span> res<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>listp current-index<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> res <span style="color: #6276BA;">(</span>nthcdr <span style="color: #858580;">(</span>car current-index<span style="color: #858580;">)</span> res<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> res <span style="color: #6276BA;">(</span>nth current-index res<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
For the setter we use Elisp's <code>setf</code> which takes a <code>PLACE</code> expression and a
value. Given the previous example path <code>(0 4 3)</code> , <code>(setf (nth 0 (nth 4 (nth
3 ast))) 'x)</code> changes the 1st element of the 3rd element of the 2nd element to
<code>'x</code>. This function is more complex because unlike the getter we can't just
iterate down the tree, we have to <i>build</i> the <code>PLACE</code> expression completely
before handing it off to <code>setf</code>.
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="orga8e0e8d"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/nset-element-at</span> <span style="color: #7388D6;">(</span>path ast new-element<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>not path<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #0000FF;">setf</span> ast new-element<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>place-fn<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>path <span style="color: #6276BA;">(</span>reverse path<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>make-place-fn
           <span style="color: #6276BA;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #858580;">(</span>path target<span style="color: #858580;">)</span>
             <span style="color: #858580;">(</span><span style="color: #0000FF;">if</span> <span style="color: #80A880;">(</span>listp path<span style="color: #80A880;">)</span>
                 `<span style="color: #80A880;">(</span>nthcdr ,path ,target<span style="color: #80A880;">)</span>
                 `<span style="color: #80A880;">(</span>nth ,path ,target<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #6276BA;">(</span>current-index <span style="color: #858580;">(</span>length path<span style="color: #858580;">)</span> nil<span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">setq</span> place-fn
                <span style="color: #858580;">(</span>funcall make-place-fn
                         <span style="color: #80A880;">(</span>nth current-index path<span style="color: #80A880;">)</span>
                         <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span>= current-index <span style="color: #D0372D;">0</span><span style="color: #887070;">)</span>
                             'ast
                           place-fn<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> <span style="color: #6276BA;">(</span><span style="color: #0000FF;">or</span> <span style="color: #858580;">(</span>consp new-element<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>shen/symbol-p new-element<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>eval `<span style="color: #858580;">(</span><span style="color: #0000FF;">setf</span> ,place-fn <span style="color: #80A880;">(</span><span style="color: #0000FF;">quote</span> ,new-element<span style="color: #80A880;">)</span><span style="color: #858580;">)</span> 't<span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span>eval `<span style="color: #858580;">(</span><span style="color: #0000FF;">setf</span> ,place-fn ,new-element<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> 't<span style="color: #907373;">)</span>
        ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
