shen-elisp.org
**** Find All
Search the tree and return paths to all the elements that are ~equal~ to the given ~X~.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/find-all (X ast)
    (if (not (consp ast))
        'shen/not-found
      (let ((lists-left-to-search `((() ,ast)))
            (found 'shen/not-found))
        (while lists-left-to-search
          (let* ((search-candidate (car lists-left-to-search))
                 (search-candidate-path (nth 0 search-candidate))
                 (current-list (nth 1 search-candidate)))
            (progn
              (setq lists-left-to-search (cdr lists-left-to-search))
              (dotimes (current-index (length current-list) nil)
                (let ((current-element (nth current-index current-list))
                      (current-path (cons current-index search-candidate-path)))
                  (if (equal X current-element)
                      (if (consp found)
                          (push current-path found)
                        (setq found (list current-path)))
                    (if (consp current-element)
                        (push `(,current-path ,current-element)
                              lists-left-to-search))))))))
        found)))
#+END_SRC
**** Find Containing List
In addition to accessing and modifying an element given a path we also need
a function that finds the list that contains an element. This following function,
given an element ~X~, a predicate function that takes *a list* that might contain
the element and an ~ast~, returns a path to *the list* containing that element
not a path to the element itself.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/list-containing-first-occurrence-of (list-pred ast)
    (if (not (consp ast))
        'shen/not-found
      (let ((lists-left-to-search `((() ,ast)))
            (found 'shen/not-found))
        (progn
          (while (and lists-left-to-search (eq found 'shen/not-found))
            (let* ((search-candidate (car lists-left-to-search))
                   (search-candidate-path (nth 0 search-candidate))
                   (current-list (nth 1 search-candidate))
                   (current-list-length (length current-list)))
              (if (funcall list-pred current-list)
                  (setq found search-candidate-path)
                (progn
                  (setq lists-left-to-search
                        (append
                         (let ((reversed-lists-in-current-list))
                           (dotimes (current-index current-list-length (reverse reversed-lists-in-current-list))
                             (if (consp (nth current-index current-list))
                                 (setq reversed-lists-in-current-list
                                       (cons (list (cons current-index search-candidate-path)
                                                   (nth current-index current-list))
                                             reversed-lists-in-current-list)))))
                         (cdr lists-left-to-search)))))))
          found))))
#+END_SRC
