shen-elisp.html
<div id="outline-container-orgb29fa7a" class="outline-4">
<h4 id="orgb29fa7a"><span class="section-number-4">3.2.3</span> AST Search</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ol class="org-ol"><li><a id="orgde17cd2"></a>Find All<br  /><div class="outline-text-5" id="text-3-2-3-1">
<p>
Search the tree and return paths to all the elements that are <code>equal</code> to the given <code>X</code>.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/find-all</span> <span style="color: #7388D6;">(</span>X ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      'shen/not-found
    <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>lists-left-to-search `<span style="color: #6276BA;">(</span><span style="color: #858580;">(</span><span style="color: #80A880;">()</span> ,ast<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>found 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">while</span> lists-left-to-search
        <span style="color: #907373;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>search-candidate <span style="color: #80A880;">(</span>car lists-left-to-search<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>search-candidate-path <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">0</span> search-candidate<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>current-list <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">1</span> search-candidate<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">progn</span>
            <span style="color: #858580;">(</span><span style="color: #0000FF;">setq</span> lists-left-to-search <span style="color: #80A880;">(</span>cdr lists-left-to-search<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #80A880;">(</span>current-index <span style="color: #887070;">(</span>length current-list<span style="color: #887070;">)</span> nil<span style="color: #80A880;">)</span>
              <span style="color: #80A880;">(</span><span style="color: #0000FF;">let</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>current-element <span style="color: #7388D6;">(</span>nth current-index current-list<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                    <span style="color: #707183;">(</span>current-path <span style="color: #7388D6;">(</span>cons current-index search-candidate-path<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span><span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>equal X current-element<span style="color: #707183;">)</span>
                    <span style="color: #707183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>consp found<span style="color: #7388D6;">)</span>
                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">push</span> current-path found<span style="color: #7388D6;">)</span>
                      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> found <span style="color: #909183;">(</span>list current-path<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                  <span style="color: #707183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>consp current-element<span style="color: #7388D6;">)</span>
                      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">push</span> `<span style="color: #909183;">(</span>,current-path ,current-element<span style="color: #909183;">)</span>
                            lists-left-to-search<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      found<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li>
<li><a id="orge290b48"></a>Find Containing List<br  /><div class="outline-text-5" id="text-3-2-3-2">
<p>
In addition to accessing and modifying an element given a path we also need
a function that finds the list that contains an element. This following function,
given an element <code>X</code>, a predicate function that takes <b>a list</b> that might contain
the element and an <code>ast</code>, returns a path to <b>the list</b> containing that element
not a path to the element itself.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/list-containing-first-occurrence-of</span> <span style="color: #7388D6;">(</span>list-pred ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      'shen/not-found
    <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>lists-left-to-search `<span style="color: #6276BA;">(</span><span style="color: #858580;">(</span><span style="color: #80A880;">()</span> ,ast<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>found 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">while</span> <span style="color: #6276BA;">(</span><span style="color: #0000FF;">and</span> lists-left-to-search <span style="color: #858580;">(</span>eq found 'shen/not-found<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #858580;">(</span><span style="color: #80A880;">(</span>search-candidate <span style="color: #887070;">(</span>car lists-left-to-search<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                 <span style="color: #80A880;">(</span>search-candidate-path <span style="color: #887070;">(</span>nth <span style="color: #D0372D;">0</span> search-candidate<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                 <span style="color: #80A880;">(</span>current-list <span style="color: #887070;">(</span>nth <span style="color: #D0372D;">1</span> search-candidate<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                 <span style="color: #80A880;">(</span>current-list-length <span style="color: #887070;">(</span>length current-list<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #0000FF;">if</span> <span style="color: #80A880;">(</span>funcall list-pred current-list<span style="color: #80A880;">)</span>
                <span style="color: #80A880;">(</span><span style="color: #0000FF;">setq</span> found search-candidate-path<span style="color: #80A880;">)</span>
              <span style="color: #80A880;">(</span><span style="color: #0000FF;">progn</span>
                <span style="color: #887070;">(</span><span style="color: #0000FF;">setq</span> lists-left-to-search
                      <span style="color: #707183;">(</span>append
                       <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>reversed-lists-in-current-list<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                         <span style="color: #909183;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #709870;">(</span>current-index current-list-length <span style="color: #907373;">(</span>reverse reversed-lists-in-current-list<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                           <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>consp <span style="color: #6276BA;">(</span>nth current-index current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                               <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> reversed-lists-in-current-list
                                     <span style="color: #6276BA;">(</span>cons <span style="color: #858580;">(</span>list <span style="color: #80A880;">(</span>cons current-index search-candidate-path<span style="color: #80A880;">)</span>
                                                 <span style="color: #80A880;">(</span>nth current-index current-list<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                           reversed-lists-in-current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                       <span style="color: #7388D6;">(</span>cdr lists-left-to-search<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        found<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li></ol>
</div>
