shen-elisp.org
*** Path Utilities
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/get-path-relative-to (parent-path path)
    (and (shen/internal/starts-with-path parent-path path)
         (shen/internal/path-slice path 0 (- (length path) (length parent-path)))))

  (defun shen/internal/starts-with-path (parent-path path)
    (and (<= (length parent-path) (length path))
         (equal parent-path
                (shen/internal/path-slice path
                                          (- (length path)
                                             (length parent-path))))))

  (defun shen/internal/get-path-parent (path) (cdr path))

  (defun shen/internal/path-slice (path start &optional end)
    (let ((start-to-end (nthcdr start path))
          (res))
      (if end
          (dotimes (i (- (if (< end (length path))
                             end
                           (length path))
                         start)
                      (nreverse res))
            (push (nth i start-to-end) res))
        start-to-end)))
#+END_SRC

*** AST Modification
Given an ~ast~, some ~paths~, destructively modify the ast with ~tx-fn~. Note
that it starts with the deepest path first so as not to invalidate paths further
up the code tree.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/modify-ast (ast paths tx-fn)
    (let ((deepest-first (sort paths (lambda (A B) (> (length A) (length B)))))
          (current-ast ast))
      (dolist (path deepest-first current-ast)
        (setq current-ast
              (shen/internal/nset-element-at path ast (funcall tx-fn path ast))))))
#+END_SRC
** List
*** Detect Dotted Pair
Note this only detects dotted pairs that look like ~'(a . b)~, not ones
that look like ~'(a b c . d)~
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/dotted-pair? (X)
    (and (consp X) (not (consp (cdr X)))))
#+END_SRC
