shen-elisp.html
<div id="outline-container-org01abc05" class="outline-4">
<h4 id="org01abc05"><span class="section-number-4">3.2.4</span> Path Utilities</h4>
<div class="outline-text-4" id="text-3-2-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/get-path-relative-to</span> <span style="color: #7388D6;">(</span>parent-path path<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> <span style="color: #909183;">(</span>shen/internal/starts-with-path parent-path path<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span>shen/internal/path-slice path <span style="color: #D0372D;">0</span> <span style="color: #709870;">(</span>- <span style="color: #907373;">(</span>length path<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>length parent-path<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/starts-with-path</span> <span style="color: #7388D6;">(</span>parent-path path<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> <span style="color: #909183;">(</span>&lt;= <span style="color: #709870;">(</span>length parent-path<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>length path<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span>equal parent-path
              <span style="color: #709870;">(</span>shen/internal/path-slice path
                                        <span style="color: #907373;">(</span>- <span style="color: #6276BA;">(</span>length path<span style="color: #6276BA;">)</span>
                                           <span style="color: #6276BA;">(</span>length parent-path<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/get-path-parent</span> <span style="color: #7388D6;">(</span>path<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>cdr path<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/path-slice</span> <span style="color: #7388D6;">(</span>path start <span style="color: #6434A3;">&amp;optional</span> end<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>start-to-end <span style="color: #907373;">(</span>nthcdr start path<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>res<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> end
        <span style="color: #709870;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #907373;">(</span>i <span style="color: #6276BA;">(</span>- <span style="color: #858580;">(</span><span style="color: #0000FF;">if</span> <span style="color: #80A880;">(</span>&lt; end <span style="color: #887070;">(</span>length path<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                           end
                         <span style="color: #80A880;">(</span>length path<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                       start<span style="color: #6276BA;">)</span>
                    <span style="color: #6276BA;">(</span>nreverse res<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">push</span> <span style="color: #6276BA;">(</span>nth i start-to-end<span style="color: #6276BA;">)</span> res<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      start-to-end<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org95a33fd" class="outline-4">
<h4 id="org95a33fd"><span class="section-number-4">3.2.5</span> AST Modification</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
Given an <code>ast</code>, some <code>paths</code>, destructively modify the ast with <code>tx-fn</code>. Note
that it starts with the deepest path first so as not to invalidate paths further
up the code tree.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/modify-ast</span> <span style="color: #7388D6;">(</span>ast paths tx-fn<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>deepest-first <span style="color: #907373;">(</span>sort paths <span style="color: #6276BA;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #858580;">(</span>A B<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>&gt; <span style="color: #80A880;">(</span>length A<span style="color: #80A880;">)</span> <span style="color: #80A880;">(</span>length B<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-ast ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #709870;">(</span>path deepest-first current-ast<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">setq</span> current-ast
            <span style="color: #907373;">(</span>shen/internal/nset-element-at path ast <span style="color: #6276BA;">(</span>funcall tx-fn path ast<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc18f8b2" class="outline-3">
<h3 id="orgc18f8b2"><span class="section-number-3">3.3</span> List</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-org43887e7" class="outline-4">
<h4 id="org43887e7"><span class="section-number-4">3.3.1</span> Detect Dotted Pair</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Note this only detects dotted pairs that look like <code>'(a . b)</code>, not ones
that look like <code>'(a b c . d)</code>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/dotted-pair?</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">and</span> <span style="color: #909183;">(</span>consp X<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp <span style="color: #907373;">(</span>cdr X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
