shen-elisp.org
*** List Filtering
A partition function that returns a pair of lists where
the first holds elements that pass and the second holds
those that fail:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/partition (pred Xs)
    (let ((a)
          (b))
      (dotimes (i (length Xs) (list a b))
        (push (nth i Xs)
              (if (funcall pred (nth i Xs)) a b)))))
#+END_SRC

A filter function that returns the elements of ~Xs~ for which
~pred~ holds but also optionally includes their index:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/filter (pred Xs &optional include-index)
    (let ((accum))
      (dotimes (i (length Xs) accum)
        (if (funcall pred (nth i Xs))
            (push (if include-index
                      (list (nth i Xs) i)
                    (nth i Xs))
                  accum)))))
#+END_SRC

A list search function that returns the index of the first
element for which ~pred~ holds:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/index-of (pred Xs)
    (let ((found)
          (index 0))
      (while (and (not found) (< index (length Xs)))
        (progn
          (if (funcall pred (nth index Xs))
              (setq found index))
          (setq index (+ index 1))))
      found))
#+END_SRC

A function that deletes the first occurrences of X
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/delete-first-eq (needle Xs)
    (let ((index (shen/internal/index-of (lambda (X) (eq X needle)) Xs)))
      (if index
          (let ((current-index 0)
                (copy))
            (while (< current-index (length Xs))
              (progn
                (if (not (= current-index index))
                    (push (nth current-index Xs) copy))
                (setq current-index (1+ current-index))))
            (nreverse copy))
        Xs)))
#+END_SRC

* Rewriting The AST
