shen-elisp.html
<div id="outline-container-org88789e5" class="outline-4">
<h4 id="org88789e5"><span class="section-number-4">3.3.2</span> List Filtering</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
A partition function that returns a pair of lists where
the first holds elements that pass and the second holds
those that fail:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/partition</span> <span style="color: #7388D6;">(</span>pred Xs<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>a<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>b<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #709870;">(</span>i <span style="color: #907373;">(</span>length Xs<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>list a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">push</span> <span style="color: #907373;">(</span>nth i Xs<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> <span style="color: #6276BA;">(</span>funcall pred <span style="color: #858580;">(</span>nth i Xs<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
A filter function that returns the elements of <code>Xs</code> for which
<code>pred</code> holds but also optionally includes their index:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/filter</span> <span style="color: #7388D6;">(</span>pred Xs <span style="color: #6434A3;">&amp;optional</span> include-index<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>accum<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #709870;">(</span>i <span style="color: #907373;">(</span>length Xs<span style="color: #907373;">)</span> accum<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>funcall pred <span style="color: #6276BA;">(</span>nth i Xs<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">push</span> <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> include-index
                    <span style="color: #858580;">(</span>list <span style="color: #80A880;">(</span>nth i Xs<span style="color: #80A880;">)</span> i<span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>nth i Xs<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                accum<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
A list search function that returns the index of the first
element for which <code>pred</code> holds:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/index-of</span> <span style="color: #7388D6;">(</span>pred Xs<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>found<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>index <span style="color: #D0372D;">0</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">while</span> <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> <span style="color: #907373;">(</span>not found<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>&lt; index <span style="color: #6276BA;">(</span>length Xs<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> <span style="color: #6276BA;">(</span>funcall pred <span style="color: #858580;">(</span>nth index Xs<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">setq</span> found index<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> index <span style="color: #6276BA;">(</span>+ index <span style="color: #D0372D;">1</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    found<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
A function that deletes the first occurrences of X
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/delete-first-eq</span> <span style="color: #7388D6;">(</span>needle Xs<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>index <span style="color: #907373;">(</span>shen/internal/index-of <span style="color: #6276BA;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #858580;">(</span>X<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>eq X needle<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> Xs<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> index
        <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>current-index <span style="color: #D0372D;">0</span><span style="color: #6276BA;">)</span>
              <span style="color: #6276BA;">(</span>copy<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">while</span> <span style="color: #6276BA;">(</span>&lt; current-index <span style="color: #858580;">(</span>length Xs<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">progn</span>
              <span style="color: #858580;">(</span><span style="color: #0000FF;">if</span> <span style="color: #80A880;">(</span>not <span style="color: #887070;">(</span>= current-index index<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                  <span style="color: #80A880;">(</span><span style="color: #0000FF;">push</span> <span style="color: #887070;">(</span>nth current-index Xs<span style="color: #887070;">)</span> copy<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #0000FF;">setq</span> current-index <span style="color: #80A880;">(</span>1+ current-index<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>nreverse copy<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      Xs<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb538ab3" class="outline-2">
<h2 id="orgb538ab3"><span class="section-number-2">4</span> Rewriting The AST</h2>
