shen-elisp.org
** Function Application
Since KLambda supports partial application and Elisp does not function application is
tricky.

First we enumerate forms that may never be partially applied:
#+NAME: Primitive Macros
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (setq shen/*primitive-macros*
        '(shen/if
          shen/and
          shen/or
          shen/cond
          shen/lambda
          shen/let
          defun
          shen/freeze
          shen/trap-error))
#+END_SRC

The general strategy to rewriting KLambda function application to Elisp is to
first blindly apply the function as though all of its arguments are present and
only deal with errors if they occur.

In the case of a [[(higher-order function)]] if normal application fails because the
function cannot be found try again with the ~shen/~ prefix. If the function has
known ~arity~, build  [[(curried lambda)][curried]] version and apply [[(incremental application)][incrementally]] and barring that just
feed the function arguments one-by-one and hope for the best.

If it is [[(a list)]] (which presumably evaluates to a function) since there is no
hope of knowing the arity only the incremental fallback is tried.

If the function has a [[(known arity)]] but is undersupplied with arguments a [[(curried
lambda)][curried]]
lambda expression *and* the subsequent ~funcalls~ are constructed. No
fallback is required this time.

In the interests of efficiency when constructing the [[(curried lambda)][lambda expression]] as many
arguments as possible are applied in one fell swoop to cut down on the overhead
of incremental application. For example if a function ~f~ takes 3 arguments but
only 2 are supplied, the constructed expresssion looks like:
#+BEGIN_EXAMPLE
(lambda (A0 A1) (lambda (A2) (apply f (list A0 A1 A2))))
#+END_EXAMPLE
instead of:
#+BEGIN_EXAMPLE
(lambda (A0) (lambda (A1) (lambda (A2) (apply f (list A0 A1 A2)))))
#+END_EXAMPLE

#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
  (defun shen/internal/apply-function (f args locally-scoped)
    (cond
     (locally-scoped       ;;(ref:higher-order function)
      `(shen/internal/apply-higher-order-function ,f (list ,@args)))
     ((consp f)            ;;(ref:a list)
      `(shen/internal/apply-function-expression ,f (list ,@args)))
     (t
      (if (fboundp 'shen/arity)
          (let ((arity (shen/internal/check-partial-application f (length args)))) ;; (ref:known arity)
            (if (= arity -1)
                `(,f ,@args)
              `(shen/internal/apply-partially (function ,f) (list ,@args))))
        `(,f ,@args)))))

  (defun shen/internal/apply-higher-order-function (f args)
    (condition-case apply-ex (apply f args)
      ('void-function
       (shen/internal/apply-higher-order-function (shen/internal/prefix-symbol f) args))
      ('wrong-number-of-arguments
       (condition-case ex
           (let ((arity (shen/internal/check-partial-application f (length args))))
             (if (= arity -1)
                 (signal (car apply-ex) (cdr apply-ex))
               (apply (eval (shen/internal/make-lambda-expression f arity (length args)) 't) args)))
         ('wrong-number-of-arguments
          (shen/internal/apply-incrementally f args))))))

  (defun shen/internal/apply-function-expression (exp args)
    (condition-case ex (apply exp args)
      ('wrong-number-of-arguments (shen/internal/apply-incrementally exp args))))

  (defun shen/internal/apply-partially (f args)
    (let ((arity (shen/internal/check-partial-application f (length args))))
      (if (= arity -1)
          (apply f args)
        (apply (eval (shen/internal/make-lambda-expression f arity (length args)) 't) args))))

  (defun shen/internal/make-lambda-expression (f arity num-args) ;; (ref:curried lambda)
    (let* ((all-args (let ((single-apply-args)
                           (blast-apply-args))
                       (dotimes (i arity (list (reverse blast-apply-args)
                                               (reverse single-apply-args)))
                         (push (intern (concat "A" (number-to-string i)))
                               (if (and num-args (< i num-args))
                                   blast-apply-args
                                 single-apply-args)))))
           (blast-apply-args (nth 0 all-args))
           (single-apply-args (nth 1 all-args))
           (expression `(apply (function ,f) (list ,@(append blast-apply-args single-apply-args)))))
      (dolist (arg (reverse single-apply-args) expression)
        (setq expression `(shen/lambda ,arg ,expression)))
      (if blast-apply-args
          `(lambda ,blast-apply-args ,expression)
        expression)))

  (defun shen/internal/apply-incrementally (f args) ;; (ref:incremental application)
    (let ((result f)
          (current-args args))
      (while current-args
        (setq result (funcall result (car current-args)))
        (setq current-args (cdr current-args)))
      result))

  (defun shen/internal/check-partial-application (f num-args)
    (let ((arity (condition-case ex (shen/arity (shen/internal/unprefix-symbol f)) ('error -1))))
      (cond
       ((eq -1 arity) -1)
       ((= arity num-args) -1)
       ((> num-args arity) -1)
       (t arity))))
#+END_SRC
