shen-elisp.html
<div id="outline-container-org52f0e1d" class="outline-3">
<h3 id="org52f0e1d"><span class="section-number-3">4.2</span> Function Application</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Since KLambda supports partial application and Elisp does not function application is
tricky.
</p>

<p>
First we enumerate forms that may never be partially applied:
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="org7440913"><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> shen/*primitive-macros*
      '<span style="color: #7388D6;">(</span>shen/if
        shen/and
        shen/or
        shen/cond
        shen/lambda
        shen/let
        defun
        shen/freeze
        shen/trap-error<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The general strategy to rewriting KLambda function application to Elisp is to
first blindly apply the function as though all of its arguments are present and
only deal with errors if they occur.
</p>

<p>
In the case of a <a href="#coderef-higher-order function"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-higher-order function');" onmouseout="CodeHighlightOff(this, 'coderef-higher-order function');">higher-order function</a> if normal application fails because the
function cannot be found try again with the <code>shen/</code> prefix. If the function has
known <code>arity</code>, build  <a href="#coderef-curried lambda"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-curried lambda');" onmouseout="CodeHighlightOff(this, 'coderef-curried lambda');">curried</a> version and apply <a href="#coderef-incremental application"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-incremental application');" onmouseout="CodeHighlightOff(this, 'coderef-incremental application');">incrementally</a> and barring that just
feed the function arguments one-by-one and hope for the best.
</p>

<p>
If it is <a href="#coderef-a list"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-a list');" onmouseout="CodeHighlightOff(this, 'coderef-a list');">a list</a> (which presumably evaluates to a function) since there is no
hope of knowing the arity only the incremental fallback is tried.
</p>

<p>
If the function has a <a href="#coderef-known arity"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-known arity');" onmouseout="CodeHighlightOff(this, 'coderef-known arity');">known arity</a> but is undersupplied with arguments a <a href="#coderef-curried lambda"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-curried lambda');" onmouseout="CodeHighlightOff(this, 'coderef-curried lambda');">curried</a>
lambda expression <b>and</b> the subsequent <code>funcalls</code> are constructed. No
fallback is required this time.
</p>

<p>
In the interests of efficiency when constructing the <a href="#coderef-curried lambda"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-curried lambda');" onmouseout="CodeHighlightOff(this, 'coderef-curried lambda');">lambda expression</a> as many
arguments as possible are applied in one fell swoop to cut down on the overhead
of incremental application. For example if a function <code>f</code> takes 3 arguments but
only 2 are supplied, the constructed expresssion looks like:
</p>
<pre class="example">
(lambda (A0 A1) (lambda (A2) (apply f (list A0 A1 A2))))
</pre>
<p>
instead of:
</p>
<pre class="example">
(lambda (A0) (lambda (A1) (lambda (A2) (apply f (list A0 A1 A2)))))
</pre>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/apply-function</span> <span style="color: #7388D6;">(</span>f args locally-scoped<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">cond</span>
<span id="coderef-higher-order function" class="coderef-off">   <span style="color: #909183;">(</span>locally-scoped       <span style="color: #8D8D84;">;;</span> (higher-order function)</span>
    `<span style="color: #709870;">(</span>shen/internal/apply-higher-order-function ,f <span style="color: #907373;">(</span>list ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
<span id="coderef-a list" class="coderef-off">   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>consp f<span style="color: #709870;">)</span>            <span style="color: #8D8D84;">;;</span> (a list)</span>
    `<span style="color: #709870;">(</span>shen/internal/apply-function-expression ,f <span style="color: #907373;">(</span>list ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>t
    <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>fboundp 'shen/arity<span style="color: #907373;">)</span>
<span id="coderef-known arity" class="coderef-off">        <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>arity <span style="color: #80A880;">(</span>shen/internal/check-partial-application f <span style="color: #887070;">(</span>length args<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> <span style="color: #8D8D84;">;;</span> (known arity)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>= arity <span style="color: #D0372D;">-1</span><span style="color: #858580;">)</span>
              `<span style="color: #858580;">(</span>,f ,@args<span style="color: #858580;">)</span>
            `<span style="color: #858580;">(</span>shen/internal/apply-partially <span style="color: #80A880;">(</span><span style="color: #0000FF;">function</span> ,f<span style="color: #80A880;">)</span> <span style="color: #80A880;">(</span>list ,@args<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
      `<span style="color: #907373;">(</span>,f ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/apply-higher-order-function</span> <span style="color: #7388D6;">(</span>f args<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">condition-case</span> apply-ex <span style="color: #909183;">(</span>apply f args<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>'void-function
     <span style="color: #709870;">(</span>shen/internal/apply-higher-order-function <span style="color: #907373;">(</span>shen/internal/prefix-symbol f<span style="color: #907373;">)</span> args<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>'wrong-number-of-arguments
     <span style="color: #709870;">(</span><span style="color: #0000FF;">condition-case</span> ex
         <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>arity <span style="color: #80A880;">(</span>shen/internal/check-partial-application f <span style="color: #887070;">(</span>length args<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
           <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>= arity <span style="color: #D0372D;">-1</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> <span style="color: #80A880;">(</span>car apply-ex<span style="color: #80A880;">)</span> <span style="color: #80A880;">(</span>cdr apply-ex<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
             <span style="color: #858580;">(</span>apply <span style="color: #80A880;">(</span>eval <span style="color: #887070;">(</span>shen/internal/make-lambda-expression f arity <span style="color: #707183;">(</span>length args<span style="color: #707183;">)</span><span style="color: #887070;">)</span> 't<span style="color: #80A880;">)</span> args<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>'wrong-number-of-arguments
        <span style="color: #6276BA;">(</span>shen/internal/apply-incrementally f args<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/apply-function-expression</span> <span style="color: #7388D6;">(</span>exp args<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">condition-case</span> ex <span style="color: #909183;">(</span>apply exp args<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>'wrong-number-of-arguments <span style="color: #709870;">(</span>shen/internal/apply-incrementally exp args<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/apply-partially</span> <span style="color: #7388D6;">(</span>f args<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>arity <span style="color: #907373;">(</span>shen/internal/check-partial-application f <span style="color: #6276BA;">(</span>length args<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>= arity <span style="color: #D0372D;">-1</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>apply f args<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>apply <span style="color: #907373;">(</span>eval <span style="color: #6276BA;">(</span>shen/internal/make-lambda-expression f arity <span style="color: #858580;">(</span>length args<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> 't<span style="color: #907373;">)</span> args<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span id="coderef-curried lambda" class="coderef-off"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/make-lambda-expression</span> <span style="color: #7388D6;">(</span>f arity num-args<span style="color: #7388D6;">)</span> <span style="color: #8D8D84;">;;</span> (curried lambda)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>all-args <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>single-apply-args<span style="color: #858580;">)</span>
                         <span style="color: #858580;">(</span>blast-apply-args<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                     <span style="color: #6276BA;">(</span><span style="color: #0000FF;">dotimes</span> <span style="color: #858580;">(</span>i arity <span style="color: #80A880;">(</span>list <span style="color: #887070;">(</span>reverse blast-apply-args<span style="color: #887070;">)</span>
                                             <span style="color: #887070;">(</span>reverse single-apply-args<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span><span style="color: #0000FF;">push</span> <span style="color: #80A880;">(</span>intern <span style="color: #887070;">(</span>concat <span style="color: #008000;">"A"</span> <span style="color: #707183;">(</span>number-to-string i<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                             <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span><span style="color: #0000FF;">and</span> num-args <span style="color: #707183;">(</span>&lt; i num-args<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                 blast-apply-args
                               single-apply-args<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>blast-apply-args <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">0</span> all-args<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>single-apply-args <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">1</span> all-args<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>expression `<span style="color: #907373;">(</span>apply <span style="color: #6276BA;">(</span><span style="color: #0000FF;">function</span> ,f<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span>list ,@<span style="color: #858580;">(</span>append blast-apply-args single-apply-args<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #709870;">(</span>arg <span style="color: #907373;">(</span>reverse single-apply-args<span style="color: #907373;">)</span> expression<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">setq</span> expression `<span style="color: #907373;">(</span><span style="color: #0000FF;">shen/lambda</span> ,arg ,expression<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> blast-apply-args
        `<span style="color: #709870;">(</span><span style="color: #0000FF;">lambda</span> ,<span style="color: #907373;">(</span>reverse blast-apply-args<span style="color: #907373;">)</span> ,expression<span style="color: #709870;">)</span>
      expression<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span id="coderef-incremental application" class="coderef-off"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/apply-incrementally</span> <span style="color: #7388D6;">(</span>f args<span style="color: #7388D6;">)</span> <span style="color: #8D8D84;">;;</span> (incremental application)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>result f<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-args args<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">while</span> current-args
      <span style="color: #709870;">(</span><span style="color: #0000FF;">setq</span> result <span style="color: #907373;">(</span>funcall result <span style="color: #6276BA;">(</span>car current-args<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">setq</span> current-args <span style="color: #907373;">(</span>cdr current-args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    result<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/check-partial-application</span> <span style="color: #7388D6;">(</span>f num-args<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>arity <span style="color: #907373;">(</span><span style="color: #0000FF;">condition-case</span> ex <span style="color: #6276BA;">(</span>shen/arity <span style="color: #858580;">(</span>shen/internal/unprefix-symbol f<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span>'error <span style="color: #D0372D;">-1</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq <span style="color: #D0372D;">-1</span> arity<span style="color: #907373;">)</span> <span style="color: #D0372D;">-1</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>= arity num-args<span style="color: #907373;">)</span> <span style="color: #D0372D;">-1</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>&gt; num-args arity<span style="color: #907373;">)</span> <span style="color: #D0372D;">-1</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>t arity<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
