shen-elisp.org
** Finding Tail Calls
Finding tail calls in a form is complex because:
- Not all self references in the tail position of a form
  are tail calls, for instance:
  #+BEGIN_EXAMPLE
  (defun f (a) (map (lambda X (f "blah")) a))
  #+END_EXAMPLE
- ~if~ and ~cond~ forms may contain multiple tail calls:
  #+BEGIN_EXAMPLE
  (defun f (a b) (if true (f a) (f b))
  (defun f (a b c) (cond (a (f a)) (b (f b)) (c (f c))))
  #+END_EXAMPLE
