shen-elisp.html
<div id="outline-container-org7050be6" class="outline-3">
<h3 id="org7050be6"><span class="section-number-3">4.3</span> Finding Tail Calls</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Finding tail calls in a form is complex because:
</p>
<ul class="org-ul">
<li><p>
Not all self references in the tail position of a form
are tail calls, for instance:
</p>
<pre class="example">
(defun f (a) (map (lambda X (f "blah")) a))
</pre></li>
<li><p>
<code>if</code> and <code>cond</code> forms may contain multiple tail calls:
</p>
<pre class="example">
(defun f (a b) (if true (f a) (f b))
(defun f (a b c) (cond (a (f a)) (b (f b)) (c (f c))))
</pre></li>
</ul>
</div>
