shen-elisp.org
**** Detecting Recursive Calls
The function follows the same basic template as searching for [[AST Search][the first
occurrence]] of something in the AST but instead of stopping at the first
encounter keeps a [[(tail-calls-found)][tally]] of paths to all tail calls.

In the case where a ~cond~ is encountered all the predicate action pairs where
the action [[(cond-filter)][can't be a function call]] are filtered out and the index of each
action is added to the list of forms that [[(lists-left-to-search)][might contain a tail call]].

In an ~if~ since the 2nd element is the predicate only the 3rd and possibly the
4th elements (if it exists) of the list are checked. In ~trap-error~ both the
action and the fallback may contain a tail call. In a ~lambda~, ~let~ and
~defun~ forms only the bodies may contain a tail call. In all other cases jump
to the end of the list and continue searching.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/find-recursive-call-paths (function-name args ast)
    (if (not (consp ast))
        'shen/not-found
      (let ((lists-left-to-search `((() ,ast))) ;; (ref:lists-left-to-search)
            (found 'shen/not-found))  ;; (ref:tail-calls-found)
        (while lists-left-to-search
          (let* ((search-candidate (car lists-left-to-search))
                 (search-candidate-path (nth 0 search-candidate))
                 (current-list (nth 1 search-candidate))
                 (current-list-length (length current-list))
                 (current-head (car current-list))
                 (push-if-list     ;; (ref:push-if-list)
                  (lambda (indexes)
                    (mapc
                     (lambda (index)
                       (if (consp (nth index current-list))
                           (setq lists-left-to-search
                                 (append lists-left-to-search
                                         (list
                                          (list (cons index search-candidate-path)
                                                (nth index current-list)))))))
                     indexes))))
            (progn
              (setq lists-left-to-search (cdr lists-left-to-search))
              (cond ((and (eq current-head function-name)
                          (= (length (cdr current-list)) (length args)))
                     (if (not (consp found))
                         (setq found (list search-candidate-path))
                       (push search-candidate-path found)))
                    ((eq current-head 'shen/cond)
                     (progn
                       (mapc
                        (lambda (action-index-pair)
                          (setq lists-left-to-search
                                (let ((path-to-action
                                       (append (list 1 (1+ (nth 1 action-index-pair)))
                                               search-candidate-path)))
                                  (append lists-left-to-search
                                          (list
                                           (list path-to-action
                                                 (nth 0 action-index-pair)))))))
                        (mapcar
                         (lambda (predicate-action-index)
                           (list (nth 1 (nth 0 predicate-action-index))
                                 (nth 1 predicate-action-index)))
                         (shen/internal/filter  ;; (ref:cond-filter)
                          (lambda (predicate-action-pair)
                            (consp (nth 1 predicate-action-pair)))
                          (cdr current-list)
                          't)))))
                    ((eq current-head 'shen/if)
                     (if (= 4 current-list-length)
                         (funcall push-if-list '(2 3))
                       (funcall push-if-list '(2))))
                    ((eq current-head 'shen/trap-error)
                     (funcall push-if-list '(1 2)))
                    ((or (eq current-head 'shen/let)
                         (eq current-head 'defun))
                     (funcall push-if-list '(3)))
                    ((eq current-head 'shen/lambda)
                     (funcall push-if-list '(2)))
                    (t (funcall push-if-list (list (- current-list-length 1))))))))
        found)))
#+END_SRC
