shen-elisp.org
**** Detecting Function Application Context
This function captures the surrounding function application context around
a tail call. For instance in the function:
#+BEGIN_EXAMPLE
(defun factorial (x) (if (= 0 x) 0 (+ 1 (factorial (- x 1)))))
#+END_EXAMPLE
~(+ 1 ...)~ is the context.

Given a path to a tail call ~tail-call-path~ it works its way from the top of
the form to that location. Since Elisp does not support lexical binding as
locally scoped variables (function arguments, let assignments) are also captured
as they are encountered in the path. When it encounters a function application
it starts "recording" that context into [[(start-accumulator)][an accumulator]].

Some forms stop the recording because they should not be captured. In the case
of [[(if-stop-recording)][if's]] just stop recording and move on, with [[(let-or-lambda-stop-recording)][let's or lambda's]] and [[(defun-stop-recording)][defun's]] skip
but also capture the assignments or arguments. In the case of [[(cond-stop-recording)][cond's]] skip twice
to move into the list containing the predicate action pair. If it is a [[(do-stop-recording)][do]] just
skip it.
#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
  (defun shen/start-of-function-chain (tail-call-path ast)
    (let* ((from-the-top (reverse tail-call-path))
           (current-from-top-path)
           (path-left-to-tail-call (reverse tail-call-path))
           (start tail-call-path) ;; (ref:start-accumulator)
           (locally-scoped))
      (cl-flet ((append-and-advance
                 (X &optional reset-start)
                 (progn
                   (setq start
                         (if reset-start ;; (ref:reset-start)
                             tail-call-path
                           current-from-top-path))
                   (setq current-from-top-path
                         (append (reverse (shen/internal/path-slice path-left-to-tail-call 0 X))
                                 current-from-top-path)
                         path-left-to-tail-call (shen/internal/path-slice path-left-to-tail-call X))

                   )))
        (while (not (equal current-from-top-path tail-call-path))
          (let* ((current-list (shen/internal/get-element-at current-from-top-path ast))
                 (current-head (car current-list)))
            (cond
             ((or (not (shen/symbol-p current-head))
                  (eq 'shen/if current-head))  ;; (ref:if-stop-recording)
              (append-and-advance 1 't))
             ((eq 'defun current-head)    ;; (ref:defun-stop-recording)
              (progn
                (setq locally-scoped (append (nth 2 current-list) locally-scoped))
                (append-and-advance 1 't)))
             ((or
               (eq 'shen/let current-head)
               (eq 'shen/lambda current-head)) ;;; (ref:let-or-lambda-stop-recording)
              (progn
                (setq locally-scoped (append (list (nth 1 current-list)) locally-scoped))
                (append-and-advance 1 't)))
             ((eq 'shen/cond current-head)     ;;; (ref:cond-stop-recording)
              (append-and-advance 2 't))
             ((eq 'shen/do current-head)       ;;; (ref:do-stop-recording)
              (append-and-advance 1 't))
             (t (append-and-advance 1)))))
        start)))
#+END_SRC
