shen-elisp.html
<li><a id="orgf56b295"></a>Detecting Function Application Context<br  /><div class="outline-text-5" id="text-4-3-0-2">
<p>
This function captures the surrounding function application context around
a tail call. For instance in the function:
</p>
<pre class="example">
(defun factorial (x) (if (= 0 x) 0 (+ 1 (factorial (- x 1)))))
</pre>
<p>
<code>(+ 1 ...)</code> is the context.
</p>

<p>
Given a path to a tail call <code>tail-call-path</code> it works its way from the top of
the form to that location. Since Elisp does not support lexical binding as
locally scoped variables (function arguments, let assignments) are also captured
as they are encountered in the path. When it encounters a function application
it starts "recording" that context into <a href="#coderef-start-accumulator"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-start-accumulator');" onmouseout="CodeHighlightOff(this, 'coderef-start-accumulator');">an accumulator</a>.
</p>

<p>
Some forms stop the recording because they should not be captured. In the case
of <a href="#coderef-if-stop-recording"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-if-stop-recording');" onmouseout="CodeHighlightOff(this, 'coderef-if-stop-recording');">if's</a> just stop recording and move on, with <a href="#coderef-let-or-lambda-stop-recording"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-let-or-lambda-stop-recording');" onmouseout="CodeHighlightOff(this, 'coderef-let-or-lambda-stop-recording');">let's or lambda's</a> and <a href="#coderef-defun-stop-recording"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-defun-stop-recording');" onmouseout="CodeHighlightOff(this, 'coderef-defun-stop-recording');">defun's</a> skip
but also capture the assignments or arguments. In the case of <a href="#coderef-cond-stop-recording"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cond-stop-recording');" onmouseout="CodeHighlightOff(this, 'coderef-cond-stop-recording');">cond's</a> skip twice
to move into the list containing the predicate action pair. If it is a <a href="#coderef-do-stop-recording"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-do-stop-recording');" onmouseout="CodeHighlightOff(this, 'coderef-do-stop-recording');">do</a> just
skip it.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/start-of-function-chain</span> <span style="color: #7388D6;">(</span>tail-call-path ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>from-the-top <span style="color: #907373;">(</span>reverse tail-call-path<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>current-from-top-path<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>path-left-to-tail-call <span style="color: #907373;">(</span>reverse tail-call-path<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
<span id="coderef-start-accumulator" class="coderef-off">         <span style="color: #709870;">(</span>start tail-call-path<span style="color: #709870;">)</span> <span style="color: #8D8D84;">;;</span> (start-accumulator)</span>
         <span style="color: #709870;">(</span>locally-scoped<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cl-flet</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>append-and-advance
               <span style="color: #6276BA;">(</span>X <span style="color: #6434A3;">&amp;optional</span> reset-start<span style="color: #6276BA;">)</span>
               <span style="color: #6276BA;">(</span><span style="color: #0000FF;">progn</span>
                 <span style="color: #858580;">(</span><span style="color: #0000FF;">setq</span> start
<span id="coderef-reset-start" class="coderef-off">                       <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> reset-start <span style="color: #8D8D84;">;;</span> (reset-start)</span>
                           tail-call-path
                         current-from-top-path<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span><span style="color: #0000FF;">setq</span> current-from-top-path
                       <span style="color: #80A880;">(</span>append <span style="color: #887070;">(</span>reverse <span style="color: #707183;">(</span>shen/internal/path-slice path-left-to-tail-call <span style="color: #D0372D;">0</span> X<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                               current-from-top-path<span style="color: #80A880;">)</span>
                       path-left-to-tail-call <span style="color: #80A880;">(</span>shen/internal/path-slice path-left-to-tail-call X<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>

                 <span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">while</span> <span style="color: #907373;">(</span>not <span style="color: #6276BA;">(</span>equal current-from-top-path tail-call-path<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>current-list <span style="color: #80A880;">(</span>shen/internal/get-element-at current-from-top-path ast<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>current-head <span style="color: #80A880;">(</span>car current-list<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">cond</span>
           <span style="color: #858580;">(</span><span style="color: #80A880;">(</span><span style="color: #0000FF;">or</span> <span style="color: #887070;">(</span>not <span style="color: #707183;">(</span>shen/symbol-p current-head<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
<span id="coderef-if-stop-recording" class="coderef-off">                <span style="color: #887070;">(</span>eq 'shen/if current-head<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>  <span style="color: #8D8D84;">;;</span> (if-stop-recording)</span>
            <span style="color: #80A880;">(</span>append-and-advance <span style="color: #D0372D;">1</span> 't<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
<span id="coderef-defun-stop-recording" class="coderef-off">           <span style="color: #858580;">(</span><span style="color: #80A880;">(</span>eq 'defun current-head<span style="color: #80A880;">)</span>    <span style="color: #8D8D84;">;;</span> (defun-stop-recording)</span>
            <span style="color: #80A880;">(</span><span style="color: #0000FF;">progn</span>
              <span style="color: #887070;">(</span><span style="color: #0000FF;">setq</span> locally-scoped <span style="color: #707183;">(</span>append <span style="color: #7388D6;">(</span>nth <span style="color: #D0372D;">2</span> current-list<span style="color: #7388D6;">)</span> locally-scoped<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>append-and-advance <span style="color: #D0372D;">1</span> 't<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
           <span style="color: #858580;">(</span><span style="color: #80A880;">(</span><span style="color: #0000FF;">or</span>
             <span style="color: #887070;">(</span>eq 'shen/let current-head<span style="color: #887070;">)</span>
<span id="coderef-let-or-lambda-stop-recording" class="coderef-off">             <span style="color: #887070;">(</span>eq 'shen/lambda current-head<span style="color: #887070;">)</span><span style="color: #80A880;">)</span> <span style="color: #8D8D84;">;;;</span> (let-or-lambda-stop-recording)</span>
            <span style="color: #80A880;">(</span><span style="color: #0000FF;">progn</span>
              <span style="color: #887070;">(</span><span style="color: #0000FF;">setq</span> locally-scoped <span style="color: #707183;">(</span>append <span style="color: #7388D6;">(</span>list <span style="color: #909183;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> locally-scoped<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>append-and-advance <span style="color: #D0372D;">1</span> 't<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
<span id="coderef-cond-stop-recording" class="coderef-off">           <span style="color: #858580;">(</span><span style="color: #80A880;">(</span>eq 'shen/cond current-head<span style="color: #80A880;">)</span>     <span style="color: #8D8D84;">;;;</span> (cond-stop-recording)</span>
            <span style="color: #80A880;">(</span>append-and-advance <span style="color: #D0372D;">2</span> 't<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
<span id="coderef-do-stop-recording" class="coderef-off">           <span style="color: #858580;">(</span><span style="color: #80A880;">(</span>eq 'shen/do current-head<span style="color: #80A880;">)</span>       <span style="color: #8D8D84;">;;;</span> (do-stop-recording)</span>
            <span style="color: #80A880;">(</span>append-and-advance <span style="color: #D0372D;">1</span> 't<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
           <span style="color: #858580;">(</span>t <span style="color: #80A880;">(</span>append-and-advance <span style="color: #D0372D;">1</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      start<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li>
