shen-elisp.org
**** Getting the Tail Calls
Now that we can get a list of recursive calls and their surrounding context
a proper tail call is simply one without any context, i.e it is the last thing
left to do.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/get-tail-call-paths (ast)
    (let* ((function-name (nth 1 ast))
           (args (nth 2 ast))
           (body (nth 3 ast))
           (recursive-call-paths (shen/internal/find-recursive-call-paths function-name args body)))
      (if (eq recursive-call-paths 'shen/not-found)
          'shen/not-found
        (let ((accum))
          (dolist (tail-call-path recursive-call-paths (if accum (reverse accum) 'shen/not-found))
            (let* ((context (shen/start-of-function-chain tail-call-path body)))
              (if (equal context tail-call-path)
                  (push (append tail-call-path (list 3)) accum))))))))
#+END_SRC
** Generating A TCO'ed Function
Finally we can optimize tail calls into trampolines. The body of the trampoline
matches the body of unoptimized function except that tail calls are replaced by
vector that holds the arguments to the recursive call fully evaluated:

An Elisp vector is chosen because KLambda code can never return one and so
uniquely identifies an intermediate return value from a recursive function.
KLambda vectors are represented by [[Vectors][hash-tables]]

A while loop extracts the arguments from the struct and passes them back into
the trampoline until it returns something other than the struct. This is the return
value.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/trampoline-body (ast)
    (let* ((args (nth 2 ast))
           (body (nth 3 ast))
           (tail-trampoline (make-symbol "tail-trampoline")))
      `(cl-flet ((,tail-trampoline ,args ,body))
         (let ((result (funcall (function ,tail-trampoline) ,@args)))
           (while (vectorp result)
             (setq result (apply (function ,tail-trampoline) (aref result 0))))
           result))))
#+END_SRC

This overall approach owes a lot to Wilfred Hughes' excellent [[https://github.com/Wilfred/tco.el][tco.el]]. The
essential difference is that he returns a function instead of a vector. Since
vectors will never appear in the generated Elisp (KLambda vectors are
hash-tables underneath), latter approach uniquely identifies a trampolined value
and guards against the possibility that if the final return value is a function
there would be no way to tell when recursion terminated.

