shen-elisp.html

<div id="outline-container-org521dfcf" class="outline-3">
<h3 id="org521dfcf"><span class="section-number-3">4.5</span> Modifying The AST</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Now that we have mechanisms for
</p>
<ul class="org-ul">
<li><a href="#org8ffa5f1">identifying</a> the parts of the AST that need changing</li>
<li><a href="#org52f0e1d">applying functions calls</a> in the face of partial application and</li>
<li><a href="#org7050be6">optimizing</a> tail calls</li>
</ul>
<p>
we are ready to transform incoming KLambda code into Elisp.
</p>

<p>
The overall flow goes like this:
</p>
<ol class="org-ol">
<li><a href="#coderef-paths"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-paths');" onmouseout="CodeHighlightOff(this, 'coderef-paths');">walk the KLambda code</a> and get a list of locations that need to be transformed</li>
<li><a href="#coderef-quote and namespace"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-quote and namespace');" onmouseout="CodeHighlightOff(this, 'coderef-quote and namespace');">quote and namespace</a> as required but hold off on function application</li>
<li>Sift through the function application locations and remove ones that point to
special forms since they cannot be curried.</li>
<li>If the KLambda is a <a href="#coderef-defun form"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-defun form');" onmouseout="CodeHighlightOff(this, 'coderef-defun form');">defun form</a>
<ol class="org-ol">
<li>Isolate function application that occurs <a href="#coderef-inside the recursive call"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-inside the recursive call');" onmouseout="CodeHighlightOff(this, 'coderef-inside the recursive call');">inside the recursive call</a>, curry
accordingly and <a href="#coderef-package up the arguments"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-package up the arguments');" onmouseout="CodeHighlightOff(this, 'coderef-package up the arguments');">package up the arguments</a> into tue struct that marks a
tail call return.</li>
<li><a href="#coderef-Sub in the recurs marker"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-Sub in the recurs marker');" onmouseout="CodeHighlightOff(this, 'coderef-Sub in the recurs marker');">Sub in the recurs marker</a> throughout the body of the form.</li>
<li>Sub in the <a href="#coderef-rest of the function applications"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-rest of the function applications');" onmouseout="CodeHighlightOff(this, 'coderef-rest of the function applications');">rest of the function applications</a></li>
<li>Add the trampolines and <a href="#coderef-write out the defun"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-write out the defun');" onmouseout="CodeHighlightOff(this, 'coderef-write out the defun');">write out the defun</a>.</li>
</ol></li>
<li>Otherwise just sub in function applications across the form without regard for tail calls.</li>
</ol>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/parse-ast</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>shen/symbol-p ast<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>list 'quote ast<span style="color: #709870;">)</span> ast<span style="color: #909183;">)</span>
<span id="coderef-paths" class="coderef-off">    <span style="color: #909183;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>function-and-symbol-paths <span style="color: #6276BA;">(</span>shen/internal/get-function-symbol-and-funcall-paths ast<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span> <span style="color: #8D8D84;">;;;</span> (paths)</span>
           <span style="color: #907373;">(</span>namespace-only <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">0</span> function-and-symbol-paths<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>quote-only <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> function-and-symbol-paths<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>possibly-apply-function <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">2</span> function-and-symbol-paths<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>current-ast ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
<span id="coderef-quote and namespace" class="coderef-off">        <span style="color: #907373;">(</span>shen/internal/namespace-and-quote current-ast namespace-only quote-only<span style="color: #907373;">)</span> <span style="color: #8D8D84;">;;;</span> (quote and namespace)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>apply-function <span style="color: #80A880;">(</span>shen/internal/filter
                               <span style="color: #887070;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #707183;">(</span>path-local<span style="color: #707183;">)</span>
                                 <span style="color: #707183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #7388D6;">(</span><span style="color: #909183;">(</span>token <span style="color: #709870;">(</span>shen/internal/get-element-at <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">0</span> path-local<span style="color: #907373;">)</span> ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                                   <span style="color: #7388D6;">(</span>not <span style="color: #909183;">(</span>memq token shen/*primitive-macros*<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                               possibly-apply-function<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
<span id="coderef-defun form" class="coderef-off">          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>eq <span style="color: #80A880;">(</span>car current-ast<span style="color: #80A880;">)</span> 'defun<span style="color: #858580;">)</span> <span style="color: #8D8D84;">;;;</span> (defun form)</span>
              <span style="color: #858580;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #80A880;">(</span><span style="color: #887070;">(</span>tail-call-paths <span style="color: #707183;">(</span>shen/internal/get-tail-call-paths ast<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span>not <span style="color: #707183;">(</span>eq tail-call-paths 'shen/not-found<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                    <span style="color: #887070;">(</span><span style="color: #0000FF;">let</span> <span style="color: #707183;">(</span><span style="color: #7388D6;">(</span>not-in-tail-call apply-function<span style="color: #7388D6;">)</span>
                          <span style="color: #7388D6;">(</span>in-tail-call<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                      <span style="color: #707183;">(</span><span style="color: #0000FF;">progn</span>
                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #909183;">(</span>path tail-call-paths nil<span style="color: #909183;">)</span>
<span id="coderef-inside the recursive call" class="coderef-off">                          <span style="color: #909183;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>tco-non-tco-pair <span style="color: #8D8D84;">;;;</span> (inside the recursive call)</span>
                                  <span style="color: #6276BA;">(</span>shen/internal/partition
                                   <span style="color: #858580;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #80A880;">(</span>apply-function-path-local<span style="color: #80A880;">)</span>
                                     <span style="color: #80A880;">(</span>shen/internal/starts-with-path path <span style="color: #887070;">(</span>nth <span style="color: #D0372D;">0</span> apply-function-path-local<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                   not-in-tail-call<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                                 <span style="color: #907373;">(</span>funcalled-tco
                                  <span style="color: #6276BA;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #858580;">(</span><span style="color: #80A880;">(</span>normalized-paths
                                          <span style="color: #887070;">(</span>shen/internal/filter
                                           <span style="color: #707183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #7388D6;">(</span>path-local<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>not <span style="color: #909183;">(</span>equal <span style="color: #709870;">(</span>nth <span style="color: #D0372D;">0</span> path-local<span style="color: #709870;">)</span> '<span style="color: #709870;">(</span><span style="color: #D0372D;">0</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                                           <span style="color: #707183;">(</span>mapcar
                                            <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>in-tco-path-local<span style="color: #909183;">)</span>
                                              <span style="color: #909183;">(</span>list
                                               <span style="color: #709870;">(</span>shen/internal/get-path-relative-to path <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">0</span> in-tco-path-local<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                                               <span style="color: #709870;">(</span>nth <span style="color: #D0372D;">1</span> in-tco-path-local<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
                                            <span style="color: #7388D6;">(</span>nth <span style="color: #D0372D;">0</span> tco-non-tco-pair<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                         <span style="color: #80A880;">(</span>tail-call <span style="color: #887070;">(</span>shen/internal/get-element-at path current-ast<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                    <span style="color: #858580;">(</span>list
                                     path
<span id="coderef-package up the arguments" class="coderef-off">                                     `<span style="color: #80A880;">(</span>vector <span style="color: #887070;">(</span>list ,@<span style="color: #707183;">(</span>cdr <span style="color: #7388D6;">(</span>shen/internal/add-funcalls tail-call normalized-paths<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #8D8D84;">;;;</span> (package up the arguments)</span>
                            <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> not-in-tail-call <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> tco-non-tco-pair<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span><span style="color: #0000FF;">push</span> funcalled-tco in-tail-call<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
<span id="coderef-Sub in the recurs marker" class="coderef-off">                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #909183;">(</span>path-tail-call in-tail-call nil<span style="color: #909183;">)</span>  <span style="color: #8D8D84;">;;;</span> (Sub in the recurs marker)</span>
                          <span style="color: #909183;">(</span>shen/internal/modify-ast current-ast <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">0</span> path-tail-call<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                                                    <span style="color: #709870;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #907373;">(</span>path current-ast<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">1</span> path-tail-call<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
<span id="coderef-rest of the function applications" class="coderef-off">                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> current-ast <span style="color: #909183;">(</span>shen/internal/add-funcalls current-ast not-in-tail-call<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> <span style="color: #8D8D84;">;;;</span> (rest of the function applications)</span>
<span id="coderef-write out the defun" class="coderef-off">                        <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> current-ast `<span style="color: #909183;">(</span><span style="color: #0000FF;">defun</span> ,<span style="color: #709870;">(</span>nth <span style="color: #D0372D;">1</span> current-ast<span style="color: #709870;">)</span> ,<span style="color: #709870;">(</span>nth <span style="color: #D0372D;">2</span> current-ast<span style="color: #709870;">)</span> ,<span style="color: #709870;">(</span>shen/trampoline-body current-ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span> <span style="color: #8D8D84;">;;;</span> (write out the defun)</span>
                  <span style="color: #887070;">(</span><span style="color: #0000FF;">setq</span> current-ast <span style="color: #707183;">(</span>shen/internal/add-funcalls current-ast apply-function<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                current-ast<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #0000FF;">progn</span>
              <span style="color: #80A880;">(</span><span style="color: #0000FF;">setq</span> current-ast <span style="color: #887070;">(</span>shen/internal/add-funcalls current-ast apply-function<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
              current-ast<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
To support the above transformation we need functions the namespace and quote the AST:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/namespace-and-quote</span> <span style="color: #7388D6;">(</span>ast namespace-only-paths quote-only-paths<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">progn</span>
    <span style="color: #909183;">(</span>shen/internal/modify-ast ast namespace-only-paths
                     <span style="color: #709870;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #907373;">(</span>path ast<span style="color: #907373;">)</span>
                       <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>element <span style="color: #80A880;">(</span>shen/internal/get-element-at path ast<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>not <span style="color: #80A880;">(</span>shen/internal/symbol-prefixed-p element<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                             <span style="color: #858580;">(</span>shen/internal/prefix-symbol <span style="color: #80A880;">(</span>shen/internal/get-element-at path ast<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                           element<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/internal/modify-ast ast quote-only-paths
                     <span style="color: #709870;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #907373;">(</span>path ast<span style="color: #907373;">)</span>
                       <span style="color: #907373;">(</span>list 'quote <span style="color: #6276BA;">(</span>shen/internal/get-element-at path ast<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    ast<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
, and run function application in the right places:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/add-funcalls</span> <span style="color: #7388D6;">(</span>ast apply-function<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>paths-only <span style="color: #907373;">(</span>mapcar <span style="color: #6276BA;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #858580;">(</span>path-local<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>nth <span style="color: #D0372D;">0</span> path-local<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> apply-function<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/internal/modify-ast ast <span style="color: #709870;">(</span>mapcar #'shen/internal/get-path-parent paths-only<span style="color: #709870;">)</span>
                     <span style="color: #709870;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #907373;">(</span>path ast<span style="color: #907373;">)</span>
                       <span style="color: #907373;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>current-funcalled-list <span style="color: #80A880;">(</span>shen/internal/get-element-at path ast<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                              <span style="color: #858580;">(</span>function-name <span style="color: #80A880;">(</span>car current-funcalled-list<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                              <span style="color: #858580;">(</span>function-arguments <span style="color: #80A880;">(</span>cdr current-funcalled-list<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                         <span style="color: #6276BA;">(</span>shen/internal/apply-function
                          function-name
                          function-arguments
                          <span style="color: #858580;">(</span>shen/internal/lookup-with-default <span style="color: #80A880;">(</span>cons <span style="color: #D0372D;">0</span> path<span style="color: #80A880;">)</span> apply-function nil<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
