shen-elisp.org
** (Unused) Isolating and Filling
I was going to do something clever with the function application context but that didn't work
so these functions are unused for now.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/make-holed-context (tail-call-path function-chain-path ast)
    (let* ((function-chain (shen/internal/get-element-at function-chain-path ast))
           (tail-call (shen/internal/get-element-at tail-call-path ast))
           (tail-call-relative-path
            (shen/internal/path-slice tail-call-path 0
                    (- (length tail-call-path)
                       (length function-chain-path)))))
      (shen/internal/nset-element-at tail-call-relative-path function-chain 'shen/__hole__)))

  (defun shen/used-in-context (context locally-scoped)
    (mapcar (lambda (symbol-index-pair)
              (nth 1 symbol-index-pair))
            (shen/internal/filter
             (lambda (v)
               (not (eq 'shen/not-found (shen/internal/find-all v context))))
             locally-scoped
             't)))

  (defun shen/substitute-in-context (context locally-scoped-alist)
    (let ((current-context context))
      (dolist (locally-scoped-pair locally-scoped-alist current-context)
        (let* ((name (nth 0 locally-scoped-pair))
               (value (nth 1 locally-scoped-pair))
               (all-matching-paths (shen/internal/find-all name current-context)))
          (if (not (eq all-matching-paths 'shen/not-found))
              (dolist (path all-matching-paths nil)
                (shen/internal/nset-element-at path current-context value)))))))
#+END_SRC

* Optimizations
** Consolidate Call Chains
KLambda code is rife with argument chains such as ~(cons x (cons y
nil))~ for list building and ~(@s "x" (@s "y" ""))~ for string concatenation
which can easily be rewritten to more efficient variadic Elisp functions.

A generic function that takes ~matcher-fn~ which finds these chains, a
~collector-fn~ that accumulates them and ~tx-fn~ which rewrites:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/consolidate (ast matcher-fn collector-fn tx-fn)
    (let* ((current-ast ast)
           (location-containing-chain
            (shen/internal/list-containing-first-occurrence-of matcher-fn ast)))
      (while (not (eq location-containing-chain 'shen/not-found))
        (let ((current-chain (shen/internal/get-element-at location-containing-chain current-ast))
              (accum))
          (progn
            (while (funcall matcher-fn current-chain)
              (let ((collected (funcall collector-fn accum current-chain)))
                (setq accum (nth 0 collected))
                (setq current-chain (nth 1 collected))))
            (setq current-ast
                  (shen/internal/nset-element-at
                   location-containing-chain
                   current-ast
                   (funcall tx-fn accum current-chain)))
            (setq location-containing-chain
                  (shen/internal/list-containing-first-occurrence-of matcher-fn current-ast)))))
      current-ast))
#+END_SRC
