shen-elisp.html

<div id="outline-container-org5bc6dbb" class="outline-3">
<h3 id="org5bc6dbb"><span class="section-number-3">4.6</span> (Unused) Isolating and Filling</h3>
<div class="outline-text-3" id="text-4-6">
<p>
I was going to do something clever with the function application context but that didn't work
so these functions are unused for now.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/make-holed-context</span> <span style="color: #7388D6;">(</span>tail-call-path function-chain-path ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>function-chain <span style="color: #907373;">(</span>shen/internal/get-element-at function-chain-path ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tail-call <span style="color: #907373;">(</span>shen/internal/get-element-at tail-call-path ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tail-call-relative-path
          <span style="color: #907373;">(</span>shen/internal/path-slice tail-call-path <span style="color: #D0372D;">0</span>
                  <span style="color: #6276BA;">(</span>- <span style="color: #858580;">(</span>length tail-call-path<span style="color: #858580;">)</span>
                     <span style="color: #858580;">(</span>length function-chain-path<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/internal/nset-element-at tail-call-relative-path function-chain 'shen/__hole__<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/used-in-context</span> <span style="color: #7388D6;">(</span>context locally-scoped<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>mapcar <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>symbol-index-pair<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>nth <span style="color: #D0372D;">1</span> symbol-index-pair<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>shen/internal/filter
           <span style="color: #709870;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #907373;">(</span>v<span style="color: #907373;">)</span>
             <span style="color: #907373;">(</span>not <span style="color: #6276BA;">(</span>eq 'shen/not-found <span style="color: #858580;">(</span>shen/internal/find-all v context<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           locally-scoped
           't<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/substitute-in-context</span> <span style="color: #7388D6;">(</span>context locally-scoped-alist<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>current-context context<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #709870;">(</span>locally-scoped-pair locally-scoped-alist current-context<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>name <span style="color: #858580;">(</span>nth <span style="color: #D0372D;">0</span> locally-scoped-pair<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
             <span style="color: #6276BA;">(</span>value <span style="color: #858580;">(</span>nth <span style="color: #D0372D;">1</span> locally-scoped-pair<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
             <span style="color: #6276BA;">(</span>all-matching-paths <span style="color: #858580;">(</span>shen/internal/find-all name current-context<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> <span style="color: #6276BA;">(</span>not <span style="color: #858580;">(</span>eq all-matching-paths 'shen/not-found<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #858580;">(</span>path all-matching-paths nil<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>shen/internal/nset-element-at path current-context value<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8991d7e" class="outline-2">
<h2 id="org8991d7e"><span class="section-number-2">5</span> Optimizations</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org4db61ef" class="outline-3">
<h3 id="org4db61ef"><span class="section-number-3">5.1</span> Consolidate Call Chains</h3>
<div class="outline-text-3" id="text-5-1">
<p>
KLambda code is rife with argument chains such as <code>(cons x (cons y
nil))</code> for list building and <code>(@s "x" (@s "y" ""))</code> for string concatenation
which can easily be rewritten to more efficient variadic Elisp functions.
</p>

<p>
A generic function that takes <code>matcher-fn</code> which finds these chains, a
<code>collector-fn</code> that accumulates them and <code>tx-fn</code> which rewrites:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/consolidate</span> <span style="color: #7388D6;">(</span>ast matcher-fn collector-fn tx-fn<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>current-ast ast<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>location-containing-chain
          <span style="color: #907373;">(</span>shen/internal/list-containing-first-occurrence-of matcher-fn ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">while</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq location-containing-chain 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>current-chain <span style="color: #858580;">(</span>shen/internal/get-element-at location-containing-chain current-ast<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>accum<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">progn</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">while</span> <span style="color: #858580;">(</span>funcall matcher-fn current-chain<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #0000FF;">let</span> <span style="color: #80A880;">(</span><span style="color: #887070;">(</span>collected <span style="color: #707183;">(</span>funcall collector-fn accum current-chain<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
              <span style="color: #80A880;">(</span><span style="color: #0000FF;">setq</span> accum <span style="color: #887070;">(</span>nth <span style="color: #D0372D;">0</span> collected<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
              <span style="color: #80A880;">(</span><span style="color: #0000FF;">setq</span> current-chain <span style="color: #887070;">(</span>nth <span style="color: #D0372D;">1</span> collected<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">setq</span> current-ast
                <span style="color: #858580;">(</span>shen/internal/nset-element-at
                 location-containing-chain
                 current-ast
                 <span style="color: #80A880;">(</span>funcall tx-fn accum current-chain<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">setq</span> location-containing-chain
                <span style="color: #858580;">(</span>shen/internal/list-containing-first-occurrence-of matcher-fn current-ast<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    current-ast<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
