shen-elisp.html
<div id="outline-container-org29f34f3" class="outline-3">
<h3 id="org29f34f3"><span class="section-number-3">5.2</span> Consolidate Cons</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Convert <code>(cons a (cons b (blah)))</code> into <code>(append (list 'a 'b) (blah))</code>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/consolidate-cons</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #D0372D;">3</span> <span style="color: #6276BA;">(</span>length current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">0</span> current-list<span style="color: #6276BA;">)</span> 'shen/cons<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum current-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>cons <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> current-chain<span style="color: #6276BA;">)</span> accum<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">2</span> current-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>eq remaining-chain 'nil<span style="color: #907373;">)</span>
         `<span style="color: #907373;">(</span>list ,@<span style="color: #6276BA;">(</span>reverse accum<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
       `<span style="color: #907373;">(</span>append <span style="color: #6276BA;">(</span>list ,@<span style="color: #858580;">(</span>reverse accum<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> ,remaining-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7ac6d10" class="outline-3">
<h3 id="org7ac6d10"><span class="section-number-3">5.3</span> Consolidate @s</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Convert <code>(@s "a" (@s "b" (blah)))</code> into <code>(concat (concat "a" "b") (blah))</code>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/consolidate-@s</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #D0372D;">3</span> <span style="color: #6276BA;">(</span>length current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">0</span> current-list<span style="color: #6276BA;">)</span> 'shen/@s<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum current-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>cons <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> current-chain<span style="color: #6276BA;">)</span> accum<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">2</span> current-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list 'concat <span style="color: #907373;">(</span>cons 'concat <span style="color: #6276BA;">(</span>reverse accum<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span> remaining-chain<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org55b123b" class="outline-3">
<h3 id="org55b123b"><span class="section-number-3">5.4</span> Consolidate tl</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Convert <code>(tl (tl (tl Xs)))</code> to <code>(nthcdr 3 Xs)</code>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/consolidate-tl</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #D0372D;">2</span> <span style="color: #6276BA;">(</span>length current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">0</span> current-list<span style="color: #6276BA;">)</span> 'shen/tl<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum current-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> <span style="color: #6276BA;">(</span>not accum<span style="color: #6276BA;">)</span> <span style="color: #D0372D;">1</span> <span style="color: #6276BA;">(</span>+ accum <span style="color: #D0372D;">1</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>nth <span style="color: #D0372D;">1</span> current-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list 'nthcdr accum remaining-chain<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org080ef92" class="outline-3">
<h3 id="org080ef92"><span class="section-number-3">5.5</span> Add 1+'s</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Convert <code>(+ X 1)</code> or <code>(+ 1 X)</code> to <code>(1+ X)</code>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/add-1+</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #D0372D;">3</span> <span style="color: #6276BA;">(</span>length current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">and</span> <span style="color: #6276BA;">(</span>eq <span style="color: #858580;">(</span>nth <span style="color: #D0372D;">0</span> current-list<span style="color: #858580;">)</span> 'shen/+<span style="color: #6276BA;">)</span>
               <span style="color: #6276BA;">(</span><span style="color: #0000FF;">or</span> <span style="color: #858580;">(</span>eq <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #80A880;">)</span> <span style="color: #D0372D;">1</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>eq <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">2</span> current-list<span style="color: #80A880;">)</span> <span style="color: #D0372D;">1</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>eq <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #6276BA;">)</span> <span style="color: #D0372D;">1</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>list <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">2</span> current-list<span style="color: #6276BA;">)</span> nil<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>list <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #6276BA;">)</span> nil<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list '1+ accum<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
