shen-elisp.org
** Nil Comparisons To Null
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/nil-to-null (ast)
    (shen/internal/consolidate
     ast
     (lambda (current-list)
       (and current-list
            (consp current-list)
            (eq 3 (length current-list))
            (and (eq (nth 0 current-list) 'shen/=)
                 (or (eq (nth 1 current-list) 'nil)
                     (eq (nth 2 current-list) 'nil)))))
     (lambda (accum current-list)
       (if (eq (nth 1 current-list) 'nil)
           (list (nth 2 current-list) nil)
         (list (nth 1 current-list) nil)))
     (lambda (accum remaining-chain)
       `(shen/internal/predicate->shen (null ,accum)))))
#+END_SRC
* Overrides
There are four types of overrides, those which:
1. boost [[Performance][performance]]
2. are necessary because Klambda functions are [[Namespacing][prefixed]].
3. fix [[Bug Fixes][klambda bugs]].

They are represented as a dotted pair alists where the ~car~ of the list is a
function name or form which when found in Klambda code is replaces with the
~cdr~ of the form.
