shen-elisp.html
<div id="outline-container-org749c258" class="outline-3">
<h3 id="org749c258"><span class="section-number-3">5.6</span> Nil Comparisons To Null</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/nil-to-null</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">and</span> current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #D0372D;">3</span> <span style="color: #6276BA;">(</span>length current-list<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">and</span> <span style="color: #6276BA;">(</span>eq <span style="color: #858580;">(</span>nth <span style="color: #D0372D;">0</span> current-list<span style="color: #858580;">)</span> 'shen/=<span style="color: #6276BA;">)</span>
               <span style="color: #6276BA;">(</span><span style="color: #0000FF;">or</span> <span style="color: #858580;">(</span>eq <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #80A880;">)</span> 'nil<span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>eq <span style="color: #80A880;">(</span>nth <span style="color: #D0372D;">2</span> current-list<span style="color: #80A880;">)</span> 'nil<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #0000FF;">if</span> <span style="color: #907373;">(</span>eq <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #6276BA;">)</span> 'nil<span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>list <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">2</span> current-list<span style="color: #6276BA;">)</span> nil<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>list <span style="color: #6276BA;">(</span>nth <span style="color: #D0372D;">1</span> current-list<span style="color: #6276BA;">)</span> nil<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     `<span style="color: #709870;">(</span>shen/internal/predicate-&gt;shen <span style="color: #907373;">(</span>null ,accum<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgeed8f15" class="outline-2">
<h2 id="orgeed8f15"><span class="section-number-2">6</span> Overrides</h2>
<div class="outline-text-2" id="text-6">
<p>
There are four types of overrides, those which:
</p>
<ol class="org-ol">
<li>boost <a href="#orgb099cae">performance</a></li>
<li>are necessary because KLambda vectors are represented as <a href="#org3da0e33">hash tables</a>.</li>
<li>are necessary because Klambda functions are <a href="#org5400114">prefixed</a>.</li>
<li>fix <a href="#org84f1566">klambda bugs</a>.</li>
</ol>

<p>
They are represented as a dotted pair alists where the <code>car</code> of the list is a
function name or form which when found in Klambda code is replaces with the
<code>cdr</code> of the form.
</p>
</div>
