shen-elisp.org
** Namespacing
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (setq shen/internal/*namespacing-overrides*
        '((function . (defun shen/function (S)
                        (shen/shen\.lookup-func
                         (shen/internal/unprefix-symbol S))))))
#+END_SRC
** Bug Fixes
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (setq shen/internal/*bugfix-overrides*
        '((untrack . (defun shen/untrack (F)
                       (progn
                         (shen/set shen.*tracking*
                                   (shen/internal/delete-first-eq
                                    F
                                    (shen/value shen.*tracking*)))
                         (shen/eval (shen/ps F)))))))
#+END_SRC

* Evaluate KLambda
Now that the mechanisms for [[Function Application][applying functions]], and [[Modifying The AST][quoting/namespacing]] are in place
converting KLambda to Elisp is just a couple of function calls.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/kl-to-elisp (Kl)
    (shen/internal/nil-to-null
     (shen/internal/add-1+
      (shen/internal/consolidate-tl
       (shen/internal/consolidate-@s
        (shen/internal/consolidate-cons (shen/internal/parse-ast Kl)))))))
#+END_SRC

Evaluating KLambda to Elisp is straight forward except that a copy of the AST is
made when evaluating a ~defun~. This is important because the AST is
destructively modified when compiled to Elisp and Shen requires the original
source for introspecting, profiling and tracking.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/eval-kl (X)
    (if (and (consp X) (eq (car X) 'defun))
        (progn
          (byte-compile (eval (shen/internal/kl-to-elisp (copy-tree X)) 't))
          (nth 1 X))
      (eval (shen/internal/kl-to-elisp X) 't)))
#+END_SRC
** Generate From Seed KLambda Files
Generating ~shen-elisp.el~, the file that contains the Elisp compiled from the
bootstrap KLambda files, requires a slightly different approach because we
[[Overrides][override]] the default generated Elisp with custom implementations. The [[Overrides][overrides]]
from above are read into a hash table and will be spliced in [[Evaluating Bootstrapped KLambda][below]].
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/add-overrides (overrides table)
    (mapc
     (lambda (override)
       (puthash (car override)
                (cdr override)
                table))
     overrides))

  (setq shen/*overrides*
        (let ((table (make-hash-table :test 'equal)))
          (shen/internal/add-overrides
           (append
            shen/internal/*performance-overrides*
            shen/internal/*dict-overrides*
            shen/internal/*namespacing-overrides*
            shen/internal/*bugfix-overrides*)
           table)
          table))
#+END_SRC
