shen-elisp.html
<div id="outline-container-org5400114" class="outline-3">
<h3 id="org5400114"><span class="section-number-3">6.3</span> Namespacing</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> shen/internal/*namespacing-overrides*
      '<span style="color: #7388D6;">(</span><span style="color: #909183;">(</span><span style="color: #0000FF;">function</span> . <span style="color: #709870;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/function</span> <span style="color: #907373;">(</span>S<span style="color: #907373;">)</span>
                      <span style="color: #907373;">(</span>shen/shen\.lookup-func
                       <span style="color: #6276BA;">(</span>shen/internal/unprefix-symbol S<span style="color: #6276BA;">)</span>
                       <span style="color: #6276BA;">(</span>shen/value 'shen\.*symbol-table*<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org84f1566" class="outline-3">
<h3 id="org84f1566"><span class="section-number-3">6.4</span> Bug Fixes</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> shen/internal/*bugfix-overrides*
      '<span style="color: #7388D6;">(</span><span style="color: #909183;">(</span>untrack . <span style="color: #709870;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/untrack</span> <span style="color: #907373;">(</span>F<span style="color: #907373;">)</span>
                     <span style="color: #907373;">(</span><span style="color: #0000FF;">progn</span>
                       <span style="color: #6276BA;">(</span>shen/set shen.*tracking*
                                 <span style="color: #858580;">(</span>shen/internal/delete-first-eq
                                  F
                                  <span style="color: #80A880;">(</span>shen/value shen.*tracking*<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                       <span style="color: #6276BA;">(</span>shen/eval <span style="color: #858580;">(</span>shen/ps F<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6d93d5a" class="outline-2">
<h2 id="org6d93d5a"><span class="section-number-2">7</span> Evaluate KLambda</h2>
<div class="outline-text-2" id="text-7">
<p>
Now that the mechanisms for <a href="#org52f0e1d">applying functions</a>, and <a href="#org521dfcf">quoting/namespacing</a> are in place
converting KLambda to Elisp is just a couple of function calls.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/kl-to-elisp</span> <span style="color: #7388D6;">(</span>Kl<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/internal/nil-to-null
   <span style="color: #909183;">(</span>shen/internal/add-1+
    <span style="color: #709870;">(</span>shen/internal/consolidate-tl
     <span style="color: #907373;">(</span>shen/internal/consolidate-@s
      <span style="color: #6276BA;">(</span>shen/internal/consolidate-cons <span style="color: #858580;">(</span>shen/internal/parse-ast Kl<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Evaluating KLambda to Elisp is straight forward except that a copy of the AST is
made when evaluating a <code>defun</code>. This is important because the AST is
destructively modified when compiled to Elisp and Shen requires the original
source for introspecting, profiling and tracking.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/eval-kl</span> <span style="color: #7388D6;">(</span>X<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span><span style="color: #0000FF;">and</span> <span style="color: #709870;">(</span>consp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq <span style="color: #907373;">(</span>car X<span style="color: #907373;">)</span> 'defun<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #0000FF;">progn</span>
        <span style="color: #709870;">(</span>byte-compile <span style="color: #907373;">(</span>eval <span style="color: #6276BA;">(</span>shen/internal/kl-to-elisp <span style="color: #858580;">(</span>copy-tree X<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> 't<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>nth <span style="color: #D0372D;">1</span> X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval <span style="color: #709870;">(</span>shen/internal/kl-to-elisp X<span style="color: #709870;">)</span> 't<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgc281f1f" class="outline-3">
<h3 id="orgc281f1f"><span class="section-number-3">7.1</span> Generate From Seed KLambda Files</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Generating <code>shen-elisp.el</code>, the file that contains the Elisp compiled from the
bootstrap KLambda files, requires a slightly different approach because we
<a href="#orgeed8f15">override</a> the default generated Elisp with custom implementations. The <a href="#orgeed8f15">overrides</a>
from above are read into a hash table and will be spliced in <a href="#org34c67da">below</a>.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/internal/add-overrides</span> <span style="color: #7388D6;">(</span>overrides table<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>mapc
   <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>override<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>puthash <span style="color: #907373;">(</span>car override<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>cdr override<span style="color: #907373;">)</span>
              table<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   overrides<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> shen/*overrides*
      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>table <span style="color: #907373;">(</span>make-hash-table <span style="color: #006FE0;">:test</span> 'equal<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>shen/internal/add-overrides
         <span style="color: #709870;">(</span>append
          shen/internal/*performance-overrides*
          shen/internal/*hash-table-overrides*
          shen/internal/*namespacing-overrides*
          shen/internal/*bugfix-overrides*<span style="color: #709870;">)</span>
         table<span style="color: #909183;">)</span>
        table<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
