shen-elisp.org
*** Evaluating Bootstrapped KLambda
When bootstrapping from the seed KLambda files we first need to [[Generate From Seed KLambda Files][patch]] the
incoming code with overrides before parsing the AST:
#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
  (defun shen/patch-klambda (ast)
   (if (eq (car ast) 'defun)
         (let ((override (gethash (nth 1 ast) shen/*overrides*)))
           (or override
               (shen/internal/parse-ast ast)))
       (let ((patched (gethash ast shen/*overrides* )))
         (or patched
             (shen/internal/parse-ast ast)))))
#+END_SRC

When saving the seed KLambda code to a file, first patch, then optimize and then append
to the end of the buffer.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/kl-to-buffer (X B)
    (with-current-buffer B
      (save-excursion
        (goto-char (point-max))
        (insert (pp-to-string
                 (shen/internal/nil-to-null
                  (shen/internal/add-1+
                   (shen/internal/consolidate-tl
                    (shen/internal/consolidate-@s
                     (shen/internal/consolidate-cons
                      (shen/patch-klambda X)))))))))))
#+END_SRC

* Providing The Primitives
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (provide 'shen-primitives)
#+END_SRC
* Overlays

Override of some of Shen's default implementations.
** License
#+BEGIN_SRC elisp :tangle shen-overlays.el
  ;; Copyright (c) 2015-2018 Aditya Siram. All Rights Reserved.
  ;; BSD 3-Clause License: http://opensource.org/licenses/BSD-3-Clause
#+END_SRC
** Repl
