shen-elisp.html
<div id="outline-container-org34c67da" class="outline-4">
<h4 id="org34c67da"><span class="section-number-4">7.1.1</span> Evaluating Bootstrapped KLambda</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
When bootstrapping from the seed KLambda files we first need to <a href="#orgc281f1f">patch</a> the
incoming code with overrides before parsing the AST:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/patch-klambda</span> <span style="color: #7388D6;">(</span>ast<span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>eq <span style="color: #709870;">(</span>car ast<span style="color: #709870;">)</span> 'defun<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>override <span style="color: #6276BA;">(</span>gethash <span style="color: #858580;">(</span>nth <span style="color: #D0372D;">1</span> ast<span style="color: #858580;">)</span> shen/*overrides*<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #0000FF;">or</span> override
             <span style="color: #907373;">(</span>shen/internal/parse-ast ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>patched <span style="color: #6276BA;">(</span>gethash ast shen/*overrides* <span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span><span style="color: #0000FF;">or</span> patched
           <span style="color: #907373;">(</span>shen/internal/parse-ast ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
When saving the seed KLambda code to a file, first patch, then optimize and then append
to the end of the buffer.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/kl-to-buffer</span> <span style="color: #7388D6;">(</span>X B<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">with-current-buffer</span> B
    <span style="color: #909183;">(</span><span style="color: #0000FF;">save-excursion</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>pp-to-string
               <span style="color: #6276BA;">(</span>shen/internal/nil-to-null
                <span style="color: #858580;">(</span>shen/internal/add-1+
                 <span style="color: #80A880;">(</span>shen/internal/consolidate-tl
                  <span style="color: #887070;">(</span>shen/internal/consolidate-@s
                   <span style="color: #707183;">(</span>shen/internal/consolidate-cons
                    <span style="color: #7388D6;">(</span>shen/patch-klambda X<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b7fbf5" class="outline-2">
<h2 id="org5b7fbf5"><span class="section-number-2">8</span> Providing The Primitives</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">provide</span> '<span style="color: #D0372D;">shen-primitives</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc420a27" class="outline-2">
<h2 id="orgc420a27"><span class="section-number-2">9</span> Overlays</h2>
<div class="outline-text-2" id="text-9">
<p>
Override of some of Shen's default implementations.
</p>
</div>
