shen-elisp.org
* Shen REPL
#+BEGIN_SRC elisp :tangle shen-repl.el :comments no
  ;; -*- lexical-binding: t -*-
  ;; Copyright (c) 2015-2018 Aditya Siram. All Rights Reserved.
  ;; BSD 3-Clause License: http://opensource.org/licenses/BSD-3-Clause
#+END_SRC

#+BEGIN_SRC elisp :tangle shen-repl.el
  (require 'comint)
  (require 'shen-primitives)
  (require 'shen-elisp)
  (require 'shen-overlays)
#+END_SRC
** Credits
The credits that appear at the top of each REPL session.
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defconst shen/shen.credits
    (format "%s\n%s\n%s\n%s\n\n"
            "Shen, copyright (C) 2010-2015 Mark Tarver"
            (format "www.shenlanguage.org, %s" (shen/value '*version*))
            (format "running under %s, implementation: %s" (shen/value '*language*) (shen/value '*implementation*))
            (format "port %s ported by %s" (shen/value '*port*) (shen/value '*porters*))))
#+END_SRC

** Prompt
The Shen REPL prompt looks like ~(0-)~ and ~(100+)~ where the number is a
counter of the number of REPL interactions so far and the ~-~ and ~+~ indicate
whether typechecking is currently enabled.

First we tell the REPL how to recognize prompts:
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defconst shen/repl-prompt-regex
    (rx line-start
        (char ?( )
              (1+ digit)
              (or (char ?-) (char ?+))
              (char ?))
        (char ? )))
#+END_SRC

and make them:
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defun shen/make-prompt nil
    (format "(%d%s) "
            (shen/length (shen/value 'shen.*history*))
            (if (shen/internal/shen->predicate (shen/value 'shen.*tc*))
                "+"
              "-")))
#+END_SRC

