shen-elisp.html
<div id="outline-container-org7605357" class="outline-3">
<h3 id="org7605357"><span class="section-number-3">9.4</span> Provide it</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">provide</span> '<span style="color: #D0372D;">shen-repl</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7cf0e03" class="outline-2">
<h2 id="org7cf0e03"><span class="section-number-2">10</span> Shen REPL</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Copyright (c) 2015-2016 Aditya Siram. All Rights Reserved.</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">BSD 3-Clause License: http://opensource.org/licenses/BSD-3-Clause</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">comint</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">shen-primitives</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">shen-elisp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">shen-overlays</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org2401594" class="outline-3">
<h3 id="org2401594"><span class="section-number-3">10.1</span> Credits</h3>
<div class="outline-text-3" id="text-10-1">
<p>
The credits that appear at the top of each REPL session.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defconst</span> <span style="color: #BA36A5;">shen/shen.credits</span>
  <span style="color: #7388D6;">(</span>format <span style="color: #008000;">"%s\n%s\n%s\n%s\n\n"</span>
          <span style="color: #008000;">"Shen, copyright (C) 2010-2015 Mark Tarver"</span>
          <span style="color: #909183;">(</span>format <span style="color: #008000;">"www.shenlanguage.org, %s"</span> <span style="color: #709870;">(</span>shen/value '*version*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>format <span style="color: #008000;">"running under %s, implementation: %s"</span> <span style="color: #709870;">(</span>shen/value '*language*<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>shen/value '*implementation*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>format <span style="color: #008000;">"port %s ported by %s"</span> <span style="color: #709870;">(</span>shen/value '*port*<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>shen/value '*porters*<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc914fd4" class="outline-3">
<h3 id="orgc914fd4"><span class="section-number-3">10.2</span> Prompt</h3>
<div class="outline-text-3" id="text-10-2">
<p>
The Shen REPL prompt looks like <code>(0-)</code> and <code>(100+)</code> where the number is a
counter of the number of REPL interactions so far and the <code>-</code> and <code>+</code> indicate
whether typechecking is currently enabled.
</p>

<p>
First we tell the REPL how to recognize prompts:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defconst</span> <span style="color: #BA36A5;">shen/repl-prompt-regex</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">rx</span> line-start
      <span style="color: #909183;">(</span>char ?<span style="color: #709870;">(</span> <span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>1+ digit<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span><span style="color: #0000FF;">or</span> <span style="color: #907373;">(</span>char ?-<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>char ?+<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>char ?<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>char ? <span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and make them:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/make-prompt</span> nil
  <span style="color: #7388D6;">(</span>format <span style="color: #008000;">"(%d%s) "</span>
          <span style="color: #909183;">(</span>shen/length <span style="color: #709870;">(</span>shen/value 'shen.*history*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span><span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>shen/internal/shen-&gt;predicate <span style="color: #907373;">(</span>shen/value 'shen.*tc*<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #008000;">"+"</span>
            <span style="color: #008000;">"-"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
