shen-elisp.html

<div id="outline-container-orgaacaf97" class="outline-3">
<h3 id="orgaacaf97"><span class="section-number-3">10.3</span> Input Events</h3>
<div class="outline-text-3" id="text-10-3">
<p>
In addition to evaluating input, the REPL also provides some rudimentary
completion support. Hitting <code>TAB</code> when inside a string tries to complete a
filename using <code>comint-filename-completion</code>. <code>shen/repl-complete-filename</code> is a
copy of <code>ielm-complete-filename</code>.
</p>

<p>
'TAB' after an open paren presents a list of Shen functions in scope. Since Shen
functions are just Elisp functions prefixed with "shen/" we use <code>mapatoms</code> to
iterate over all the symbols and functions and keep only the prefixed functions
as completion candidates. Other that <code>shen/repl-completion-at-point</code> pretty much
copies <code>elisp-completion-at-point</code>.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defvar</span> <span style="color: #BA36A5;">shen/repl-map</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>map <span style="color: #907373;">(</span>make-sparse-keymap<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-key map <span style="color: #008000;">"\C-j"</span> 'shen/repl-send-input<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-key map <span style="color: #008000;">"\C-m"</span> 'shen/repl-return<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-key map <span style="color: #008000;">"\t"</span> 'shen/repl-tab<span style="color: #909183;">)</span>
    map<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defvaralias</span> '<span style="color: #BA36A5;">shen/repl-mode-map</span> 'shen/repl-map<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-return</span> nil
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>shen/repl-send-input<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-tab</span> nil
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>completion-at-point<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-complete-filename</span> nil
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">when</span> <span style="color: #909183;">(</span>nth <span style="color: #D0372D;">3</span> <span style="color: #709870;">(</span>parse-partial-sexp comint-last-input-start <span style="color: #907373;">(</span>point<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>comint-filename-completion<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-completion-at-point</span> nil
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>pos <span style="color: #907373;">(</span>point<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>beg <span style="color: #907373;">(</span><span style="color: #0000FF;">condition-case</span> nil
                  <span style="color: #6276BA;">(</span><span style="color: #0000FF;">save-excursion</span>
                    <span style="color: #858580;">(</span>backward-sexp <span style="color: #D0372D;">1</span><span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span>point<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                <span style="color: #6276BA;">(</span>scan-error pos<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>end
          <span style="color: #907373;">(</span><span style="color: #0000FF;">unless</span> <span style="color: #6276BA;">(</span><span style="color: #0000FF;">or</span> <span style="color: #858580;">(</span>eq beg <span style="color: #80A880;">(</span>point-max<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                      <span style="color: #858580;">(</span>member <span style="color: #80A880;">(</span>char-syntax <span style="color: #887070;">(</span>char-after beg<span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                              '<span style="color: #80A880;">(</span>?\s ?\" ?\( ?\)<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">condition-case</span> nil
                <span style="color: #858580;">(</span><span style="color: #0000FF;">save-excursion</span>
                  <span style="color: #80A880;">(</span>goto-char beg<span style="color: #80A880;">)</span>
                  <span style="color: #80A880;">(</span>forward-sexp <span style="color: #D0372D;">1</span><span style="color: #80A880;">)</span>
                  <span style="color: #80A880;">(</span><span style="color: #0000FF;">when</span> <span style="color: #887070;">(</span>&gt;= <span style="color: #707183;">(</span>point<span style="color: #707183;">)</span> pos<span style="color: #887070;">)</span>
                    <span style="color: #887070;">(</span>point<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>scan-error pos<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>shen-functions
          <span style="color: #907373;">(</span><span style="color: #0000FF;">let</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>res <span style="color: #80A880;">(</span>make-vector <span style="color: #D0372D;">100</span> <span style="color: #D0372D;">0</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>mapatoms
             <span style="color: #858580;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #80A880;">(</span>S<span style="color: #80A880;">)</span>
               <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> <span style="color: #887070;">(</span><span style="color: #0000FF;">and</span> <span style="color: #707183;">(</span>fboundp S<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>string-prefix-p shen/prefix <span style="color: #7388D6;">(</span>symbol-name S<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span>intern <span style="color: #707183;">(</span>substring <span style="color: #7388D6;">(</span>symbol-name S<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>length shen/prefix<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                           res<span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            res<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>list beg end shen-functions<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
