shen-repl.el

;; [[file:~/Lisp/shen-elisp/shen-elisp.org::*Input%20Events][Input Events:1]]
(defvar shen/repl-map
  (let ((map (make-sparse-keymap)))
    (define-key map "\C-j" 'shen/repl-send-input)
    (define-key map "\C-m" 'shen/repl-return)
    (define-key map "\t" 'shen/repl-tab)
    map))

(defvaralias 'shen/repl-mode-map 'shen/repl-map)

(defun shen/repl-return nil
  (interactive)
  (shen/repl-send-input))

(defun shen/repl-tab nil
  (interactive)
  (completion-at-point))

(defun shen/repl-complete-filename nil
  (when (nth 3 (parse-partial-sexp comint-last-input-start (point)))
    (comint-filename-completion)))

(defun shen/repl-completion-at-point nil
  (let* ((pos (point))
         (beg (condition-case nil
                  (save-excursion
                    (backward-sexp 1)
                    (point))
                (scan-error pos)))
         (end
          (unless (or (eq beg (point-max))
                      (member (char-syntax (char-after beg))
                              '(?\s ?\" ?\( ?\))))
            (condition-case nil
                (save-excursion
                  (goto-char beg)
                  (forward-sexp 1)
                  (when (>= (point) pos)
                    (point)))
              (scan-error pos))))
         (shen-functions
          (let ((res (make-vector 100 0)))
            (mapatoms
             (lambda (S)
               (if (and (fboundp S) (string-prefix-p shen/prefix (symbol-name S)))
                   (intern (substring (symbol-name S) (length shen/prefix))
                           res))))
            res)))
    (list beg end shen-functions
          :annotation-function #'shen/repl-annotate-type-or-arity)))

(defun shen/repl-annotate-type-or-arity (S)
  (let ((signature (member-if (lambda (F) (string-equal (symbol-name (car F)) S)) shen/shen.*signedfuncs*)))
    (if signature
        (format " : %s" (cdr (car signature)))
      (let ((arity (condition-case ex (shen/arity S) ('error -1))))
        (if (not (eq arity -1))
            (format "%d" arity)
          "")))))
;; Input Events:1 ends here

;; [[file:~/Lisp/shen-elisp/shen-elisp.org::*Sending%20Input][Sending Input:1]]
(defvar shen/repl-input)
