shen-elisp.org
** Sending Input
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defvar shen/repl-input)

  (defun shen/repl-send-input nil
    (interactive)
    (progn
      (comint-send-input)
      (condition-case ex
          (progn
            (shen/shen.initialise_environment)
            (shen/repl-eval (string-to-list shen/repl-input)))
        ('error
         (comint-output-filter (shen/repl-process) (format "%s\n%s" ex  (shen/make-prompt)))
         (signal (car ex) (cdr ex))))
      (with-current-buffer *shen-repl*
        (goto-char (point-max)))))
#+END_SRC
