shen-elisp.html
<div id="outline-container-org37268e6" class="outline-3">
<h3 id="org37268e6"><span class="section-number-3">10.4</span> Sending Input</h3>
<div class="outline-text-3" id="text-10-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defvar</span> <span style="color: #BA36A5;">shen/repl-input</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-send-input</span> nil
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">progn</span>
    <span style="color: #909183;">(</span>comint-send-input<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">condition-case</span> ex
        <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
          <span style="color: #907373;">(</span>shen/shen.initialise_environment<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>shen/repl-eval <span style="color: #6276BA;">(</span>string-to-list shen/repl-input<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>'error
       <span style="color: #907373;">(</span>comint-output-filter <span style="color: #6276BA;">(</span>shen/repl-process<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span>format <span style="color: #008000;">"%s\n%s"</span> ex  <span style="color: #858580;">(</span>shen/make-prompt<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> <span style="color: #6276BA;">(</span>car ex<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span>cdr ex<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">with-current-buffer</span> *shen-repl*
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
