shen-elisp.org
** Evaluating User Input
The following is a cut-and-paste of ~ielm-standard-output-impl~ which apparently
does not exist in older versions of Emacs (a user reported a bug on 24.4.1).

It periodically writes to the REPL.
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defun shen/repl-standard-output-impl (process)
    (let* ((output-buffer nil)
           (flush-timer nil)
           (flush-buffer
            (lambda ()
              (comint-output-filter
               process
               (apply #'string (nreverse output-buffer)))
              (redisplay)
              (setf output-buffer nil)
              (when flush-timer
                (cancel-timer flush-timer)
                (setf flush-timer nil)))))
      (lambda (char)
        (let (flush-now)
          (cond ((and (eq char t) output-buffer)
                 (setf flush-now t))
                ((characterp char)
                 (push char output-buffer)))
          (if flush-now
              (funcall flush-buffer)
            (unless flush-timer
              (setf flush-timer (run-with-timer 0.1 nil flush-buffer))))))))
#+END_SRC

#+BEGIN_SRC elisp :tangle shen-repl.el
  (defun shen/repl-process nil
    ;; Return the current buffer's process.
    (get-buffer-process (current-buffer)))

  (defun shen/repl-eval (input-string)
    (let* ((active-process (shen/repl-process))
           (shen/repl-temp-buffer)
           (clean-up (lambda (active-process &optional ex)
                       (progn
                         (funcall (shen/value '*stoutput*) t)
                         (comint-output-filter active-process
                                               (if ex
                                                   (format "\n%s\n\n%s" (nth 1 ex) (shen/make-prompt))
                                                 (format "\n%s" (shen/make-prompt))))
                         (shen/set '*stoutput* standard-output)))))
      (condition-case ex
          (progn
            (shen/set '*stoutput* (shen/repl-standard-output-impl active-process))
            (set-buffer (get-buffer *shen-repl*))
            (let* ((Lineread
                    (shen/compile #'shen/shen.<st_input> input-string
                                  (lambda (Err) (signal (car Err) (cdr Err)))))
                   (It (shen/shen.record-it input-string))
                   (History (shen/value 'shen.*history*))
                   (NewLineread (shen/shen.retrieve-from-history-if-needed
                                 (shen/@p Lineread input-string)
                                 History))
                   (NewHistory (shen/shen.update_history NewLineread History))
                   (Parsed (shen/fst NewLineread)))
              (if (not Parsed)
                  (funcall clean-up active-process)
                (progn
                  (shen/shen.toplevel Parsed)
                  (funcall (shen/value '*stoutput*) t)
                  (comint-output-filter active-process (format "\n%s" (shen/make-prompt)))))))
        ('shen/error (funcall clean-up active-process ex)))))
#+END_SRC
