shen-elisp.html
<div id="outline-container-org9e4d6b2" class="outline-3">
<h3 id="org9e4d6b2"><span class="section-number-3">10.5</span> Evaluating User Input</h3>
<div class="outline-text-3" id="text-10-5">
<p>
The following is a cut-and-paste of <code>ielm-standard-output-impl</code> which apparently
does not exist in older versions of Emacs (a user reported a bug on 24.4.1).
</p>

<p>
It periodically writes to the REPL.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-standard-output-impl</span> <span style="color: #7388D6;">(</span>process<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>output-buffer nil<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>flush-timer nil<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>flush-buffer
          <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">()</span>
            <span style="color: #6276BA;">(</span>comint-output-filter
             process
             <span style="color: #858580;">(</span>apply #'string <span style="color: #80A880;">(</span>nreverse output-buffer<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>redisplay<span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">setf</span> output-buffer nil<span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">when</span> flush-timer
              <span style="color: #858580;">(</span>cancel-timer flush-timer<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #0000FF;">setf</span> flush-timer nil<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>char<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span>flush-now<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span><span style="color: #0000FF;">and</span> <span style="color: #80A880;">(</span>eq char t<span style="color: #80A880;">)</span> output-buffer<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span><span style="color: #0000FF;">setf</span> flush-now t<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
              <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>characterp char<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span><span style="color: #0000FF;">push</span> char output-buffer<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">if</span> flush-now
            <span style="color: #6276BA;">(</span>funcall flush-buffer<span style="color: #6276BA;">)</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">unless</span> flush-timer
            <span style="color: #858580;">(</span><span style="color: #0000FF;">setf</span> flush-timer <span style="color: #80A880;">(</span>run-with-timer <span style="color: #D0372D;">0.1</span> nil flush-buffer<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-process</span> nil
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Return the current buffer's process.</span>
  <span style="color: #7388D6;">(</span>get-buffer-process <span style="color: #909183;">(</span>current-buffer<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-eval</span> <span style="color: #7388D6;">(</span>input-string<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>active-process <span style="color: #907373;">(</span>shen/repl-process<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>shen/repl-temp-buffer<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>clean-up <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">(</span>active-process <span style="color: #6434A3;">&amp;optional</span> ex<span style="color: #6276BA;">)</span>
                     <span style="color: #6276BA;">(</span><span style="color: #0000FF;">progn</span>
                       <span style="color: #858580;">(</span>funcall <span style="color: #80A880;">(</span>shen/value '*stoutput*<span style="color: #80A880;">)</span> t<span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>comint-output-filter active-process
                                             <span style="color: #80A880;">(</span><span style="color: #0000FF;">if</span> ex
                                                 <span style="color: #887070;">(</span>format <span style="color: #008000;">"\n%s\n\n%s"</span> <span style="color: #707183;">(</span>nth <span style="color: #D0372D;">1</span> ex<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>shen/make-prompt<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                               <span style="color: #887070;">(</span>format <span style="color: #008000;">"\n%s"</span> <span style="color: #707183;">(</span>shen/make-prompt<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>shen/set '*stoutput* standard-output<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">condition-case</span> ex
        <span style="color: #709870;">(</span><span style="color: #0000FF;">progn</span>
          <span style="color: #907373;">(</span>shen/set '*stoutput* <span style="color: #6276BA;">(</span>shen/repl-standard-output-impl active-process<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>set-buffer <span style="color: #6276BA;">(</span>get-buffer *shen-repl*<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #6276BA;">(</span><span style="color: #858580;">(</span>Lineread
                  <span style="color: #80A880;">(</span>shen/compile #'shen/shen.&lt;st_input&gt; input-string
                                <span style="color: #887070;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #707183;">(</span>Err<span style="color: #707183;">)</span> <span style="color: #707183;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> <span style="color: #7388D6;">(</span>car Err<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">(</span>cdr Err<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>It <span style="color: #80A880;">(</span>shen/shen.record-it input-string<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>History <span style="color: #80A880;">(</span>shen/value 'shen.*history*<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>NewLineread <span style="color: #80A880;">(</span>shen/shen.retrieve-from-history-if-needed
                               <span style="color: #887070;">(</span>shen/@p Lineread input-string<span style="color: #887070;">)</span>
                               History<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>NewHistory <span style="color: #80A880;">(</span>shen/shen.update_history NewLineread History<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>Parsed <span style="color: #80A880;">(</span>shen/fst NewLineread<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span>not Parsed<span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span>funcall clean-up active-process<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #0000FF;">progn</span>
                <span style="color: #80A880;">(</span>shen/shen.toplevel Parsed<span style="color: #80A880;">)</span>
                <span style="color: #80A880;">(</span>funcall <span style="color: #887070;">(</span>shen/value '*stoutput*<span style="color: #887070;">)</span> t<span style="color: #80A880;">)</span>
                <span style="color: #80A880;">(</span>comint-output-filter active-process <span style="color: #887070;">(</span>format <span style="color: #008000;">"\n%s"</span> <span style="color: #707183;">(</span>shen/make-prompt<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>'shen/error <span style="color: #907373;">(</span>funcall clean-up active-process ex<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
