shen-elisp.html
<div id="outline-container-orge6d04f7" class="outline-3">
<h3 id="orge6d04f7"><span class="section-number-3">10.6</span> The REPL Mode</h3>
<div class="outline-text-3" id="text-10-6">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defconst</span> <span style="color: #BA36A5;">shen/syntax-table</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>table <span style="color: #907373;">(</span>make-syntax-table lisp-mode-syntax-table<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry <span style="color: #D0372D;">59</span> <span style="color: #008000;">"_"</span><span style="color: #909183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">semi-colon</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?, <span style="color: #008000;">"_"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?# <span style="color: #008000;">"_"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?' <span style="color: #008000;">"_"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?` <span style="color: #008000;">"_"</span><span style="color: #909183;">)</span>
    table<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-input-sender</span> <span style="color: #7388D6;">(</span>_proc input<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> shen/repl-input input<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-pm</span> nil
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Return the process mark of the current buffer.</span>
  <span style="color: #7388D6;">(</span>process-mark <span style="color: #909183;">(</span>get-buffer-process <span style="color: #709870;">(</span>current-buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl-set-pm</span> <span style="color: #7388D6;">(</span>pos<span style="color: #7388D6;">)</span>
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Set the process mark in the current buffer to POS.</span>
  <span style="color: #7388D6;">(</span>set-marker <span style="color: #909183;">(</span>process-mark <span style="color: #709870;">(</span>get-buffer-process <span style="color: #907373;">(</span>current-buffer<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> pos<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">define-derived-mode</span> <span style="color: #006699;">shen/repl-mode</span> comint-mode <span style="color: #008000;">"shen-repl-mode"</span>
  <span style="color: #006FE0;">:syntax-table</span> shen/syntax-table
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> comint-prompt-regexp shen/repl-prompt-regex<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> comint-use-prompt-regexp t<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> comint-prompt-read-only t<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> comint-input-sender 'shen/repl-input-sender<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq-local</span> comment-use-syntax 'undecided<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>set <span style="color: #909183;">(</span>make-local-variable 'completion-at-point-functions<span style="color: #909183;">)</span>
       '<span style="color: #909183;">(</span>comint-replace-by-expanded-history
         shen/repl-complete-filename
         shen/repl-completion-at-point<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">unless</span> <span style="color: #909183;">(</span>comint-check-proc <span style="color: #709870;">(</span>current-buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">condition-case</span> nil
        <span style="color: #709870;">(</span>start-process <span style="color: #008000;">"shen/repl"</span> <span style="color: #907373;">(</span>current-buffer<span style="color: #907373;">)</span> <span style="color: #008000;">"cat"</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>file-error <span style="color: #907373;">(</span>start-process <span style="color: #008000;">"shen/repl"</span> <span style="color: #6276BA;">(</span>current-buffer<span style="color: #6276BA;">)</span> <span style="color: #008000;">"hexl"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-process-query-on-exit-flag <span style="color: #709870;">(</span>shen/repl-process<span style="color: #709870;">)</span> nil<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>goto-char <span style="color: #709870;">(</span>point-max<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set <span style="color: #709870;">(</span>make-local-variable 'comint-inhibit-carriage-motion<span style="color: #709870;">)</span> t<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert shen/shen.credits<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/repl-set-pm <span style="color: #709870;">(</span>point-max<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>comint-output-filter <span style="color: #709870;">(</span>shen/repl-process<span style="color: #709870;">)</span> <span style="color: #008000;">"(0-) "</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-marker comint-last-input-start <span style="color: #709870;">(</span>shen/repl-pm<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-process-filter <span style="color: #709870;">(</span>get-buffer-process <span style="color: #907373;">(</span>current-buffer<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 'comint-output-filter<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defconst</span> <span style="color: #BA36A5;">*shen-repl*</span> <span style="color: #008000;">"*shen-repl*"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
