shen-elisp.org
** Starting the REPL
#+BEGIN_SRC elisp :tangle shen-repl.el
  ;;;###autoload
  (defun shen/repl nil
    (interactive)
    (let (old-point)
      (unless (get-buffer *shen-repl*)
        (with-current-buffer (get-buffer-create *shen-repl*)
          (make-local-variable 'lexical-binding)
          (load "shen-primitives.elc")
          (load "shen-elisp.elc")
          (load "shen-overlays.elc")
          (setq lexical-binding 't)
          (shen/set 'shen.*history* '())
          (shen/set '*home-directory* "")
          (shen/set 'shen.*tc* 'false)
          (unless (zerop (buffer-size)) (setq old-point (point)))
          (shen/repl-mode)))
      (switch-to-buffer *shen-repl*)
      (when old-point (push-mark old-point))))
#+END_SRC
** Provide it
#+BEGIN_SRC elisp :tangle shen-repl.el
  (provide 'shen-repl)
#+END_SRC
* Bootstrap
Bootstrapping a Shen environment involves
1. collecting all the KLambda files in the "KLambda" directory in this package into a variable
2. modifying the Elisp reader so it doesn't choke on what it would consider illegal symbols in KLambda
3. iterating over the KLambda files, parse out and evaluate KLambda s-expressions
4. providing a runner that kicks off the process
** Collecting KLambda files
In order to bootstrap the environment we specify the location of all the KLambda files
that need to be read in and compiled. They are located in the ~KLambda~ directory of this
package.
#+BEGIN_SRC elisp :tangle install.el
  (require 'shen-primitives)
  (setq *klambda-directory-name* "KLambda")
  (setq *klambda-directory* (file-name-as-directory (concat (file-name-directory load-file-name) *klambda-directory-name*)))
  (setq *klambda-files*
        (mapcar (lambda (klFile) (concat *klambda-directory* klFile))
                '("toplevel.kl" "core.kl" "sys.kl" "dict.kl" "sequent.kl"
                  "yacc.kl" "reader.kl" "prolog.kl" "track.kl" "load.kl"
                  "writer.kl" "macros.kl" "declarations.kl" "t-star.kl" "types.kl")))
#+END_SRC

In order to read in the KLambda s-expressions using the Elisp reader we need to
make some adjustments due to the differences between KLambda and Elisp.
