shen-elisp.html
<div id="outline-container-org06658cf" class="outline-3">
<h3 id="org06658cf"><span class="section-number-3">10.7</span> Starting the REPL</h3>
<div class="outline-text-3" id="text-10-7">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #8D8D84;">;;;</span><span style="color: #8D8D84; font-style: italic;">###</span><span style="color: #ff0000; font-weight: bold; font-style: italic;">autoload</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">shen/repl</span> nil
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span>old-point<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">unless</span> <span style="color: #709870;">(</span>get-buffer *shen-repl*<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">with-current-buffer</span> <span style="color: #907373;">(</span>get-buffer-create *shen-repl*<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>make-local-variable 'lexical-binding<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>load <span style="color: #008000;">"shen-primitives.elc"</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>load <span style="color: #008000;">"shen-elisp.elc"</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>load <span style="color: #008000;">"shen-overlays.elc"</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/migrate-symbol-table<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">setq</span> lexical-binding 't<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set 'shen.*history* '<span style="color: #6276BA;">()</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set '*home-directory* <span style="color: #008000;">""</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set 'shen.*tc* 'false<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">unless</span> <span style="color: #6276BA;">(</span>zerop <span style="color: #858580;">(</span>buffer-size<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span><span style="color: #0000FF;">setq</span> old-point <span style="color: #858580;">(</span>point<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/repl-mode<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>switch-to-buffer *shen-repl*<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">when</span> old-point <span style="color: #709870;">(</span>push-mark old-point<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org270053c" class="outline-3">
<h3 id="org270053c"><span class="section-number-3">10.8</span> Provide it</h3>
<div class="outline-text-3" id="text-10-8">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">provide</span> '<span style="color: #D0372D;">shen-repl</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb70a2fe" class="outline-2">
<h2 id="orgb70a2fe"><span class="section-number-2">11</span> Bootstrap</h2>
<div class="outline-text-2" id="text-11">
<p>
Bootstrapping a Shen environment involves
</p>
<ol class="org-ol">
<li>collecting all the KLambda files in the "KLambda" directory in this package into a variable</li>
<li>modifying the Elisp reader so it doesn't choke on what it would consider illegal symbols in KLambda</li>
<li>iterating over the KLambda files, parse out and evaluate KLambda s-expressions</li>
<li>providing a runner that kicks off the process</li>
</ol>
</div>
<div id="outline-container-org3d4557f" class="outline-3">
<h3 id="org3d4557f"><span class="section-number-3">11.1</span> Collecting KLambda files</h3>
<div class="outline-text-3" id="text-11-1">
<p>
In order to bootstrap the environment we specify the location of all the KLambda files
that need to be read in and compiled. They are located in the <code>KLambda</code> directory of this
package.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">shen-primitives</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> *klambda-directory-name* <span style="color: #008000;">"KLambda"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> *klambda-directory* <span style="color: #7388D6;">(</span>file-name-as-directory <span style="color: #909183;">(</span>concat <span style="color: #709870;">(</span>file-name-directory load-file-name<span style="color: #709870;">)</span> *klambda-directory-name*<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> *klambda-files*
      <span style="color: #7388D6;">(</span>mapcar <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>klFile<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>concat *klambda-directory* klFile<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
              '<span style="color: #909183;">(</span><span style="color: #008000;">"toplevel.kl"</span> <span style="color: #008000;">"core.kl"</span> <span style="color: #008000;">"sys.kl"</span> <span style="color: #008000;">"sequent.kl"</span> <span style="color: #008000;">"yacc.kl"</span>
                <span style="color: #008000;">"reader.kl"</span> <span style="color: #008000;">"prolog.kl"</span> <span style="color: #008000;">"track.kl"</span> <span style="color: #008000;">"load.kl"</span> <span style="color: #008000;">"writer.kl"</span>
                <span style="color: #008000;">"macros.kl"</span> <span style="color: #008000;">"declarations.kl"</span> <span style="color: #008000;">"types.kl"</span> <span style="color: #008000;">"t-star.kl"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
In order to read in the KLambda s-expressions using the Elisp reader we need to
make some adjustments due to the differences between KLambda and Elisp.
</p>
</div>
</div>
