shen-elisp.org
** Modifying The Elisp Reader For KLambda
In KLambda semicolons, colons, commas, ticks and backquotes are valid symbols. Since they have
different meanings in Elisp they will be rejected by the reader by default so we
need to insert them as regular symbols into a temporary ~syntax-table~ and then
parse out the s-expressions.
#+BEGIN_SRC elisp :tangle install.el
  (setq shen/*klambda-syntax-table*
        (let ((table (make-syntax-table lisp-mode-syntax-table)))
          (modify-syntax-entry 59 "_" table) ;; semi-colon
          (modify-syntax-entry ?, "_" table)
          (modify-syntax-entry ?# "_" table)
          (modify-syntax-entry ?' "_" table)
          (modify-syntax-entry ?` "_" table)
          table))

  (defun shen/get-klambda-sexp-strings (klambda-file)
    (with-temp-buffer
      (insert-file-contents klambda-file)
      (with-syntax-table shen/*klambda-syntax-table*
        (let* ((klambda-code (buffer-string))
               (current-sexp-end (scan-lists 0 1 0))
               (groups nil))
          (progn
            (while current-sexp-end
              (let ((current-sexp-start (scan-lists current-sexp-end -1 0)))
                (progn
                  (setq groups (nconc groups (list (buffer-substring current-sexp-start current-sexp-end))))
                  (setq current-sexp-end (scan-lists current-sexp-end 1 0)))))
            groups)))))
#+END_SRC

Even though simply changing the syntax table works for parsing the s-expressions
as strings, the Elisp reader will still choke on illegal characters.

Each of those forbidden characters is encoded as a string that is unlikely to
occur in the normal course of events (hopefully). The name of the character is
interleaved with its reverse and prefixed an ~_~. So, for example, ~#~ , spelled
"hash" becomes "_hhassahh" which is the interleaving of "hash" and "hsah" with a
leading underscore.

The mappings are stored in an alist and forward and reverse lookup functions are
provided
#+BEGIN_SRC elisp :tangle install.el
  (setq shen/*illegal-character->spelling*
        '((59 "_sneomlioccoilmoens")  ;; semicolon
          (?, "_caommmmoac")
          (35 "_hhassshh")            ;; hash
          (?' "_tkiccikt")
          (?` "_beatcokuqqukoctaeb")))

  (setq shen/*spelling->illegal-character*
        (mapcar #'reverse shen/*illegal-character->spelling*))
#+END_SRC


With the mapping in place the klambda s-expressions can be sanitized for the Elisp reader:
#+BEGIN_SRC elisp :tangle install.el
  (defun shen/remove-reserved-elisp-characters (klambda-sexp-string)
    (let ((InString nil)
          (illegal-characters
           (mapcar
            (lambda (char->spelling) (nth 0 char->spelling))
            shen/*illegal-character->spelling*))
          (res)
          (curr klambda-sexp-string))
      (cl-flet ((append-and-advance
                 (&optional X)
                 (progn
                   (if X (setq res (concat res X))
                     (setq res (concat res (substring curr 0 1))))
                   (setq curr (substring curr 1)))))
        (while (not (= 0 (length curr)))
          (cond
           ((char-equal (string-to-char curr) ?\")
            (if InString
                (progn
                  (setq InString nil)
                  (append-and-advance))
              (progn
                (setq InString 't)
                (append-and-advance))))
           ((memq (string-to-char curr) illegal-characters)
            (if InString
                (append-and-advance)
              (append-and-advance
               (car (assoc-default
                     (string-to-char curr)
                     shen/*illegal-character->spelling*)))))
           (t (append-and-advance))))
        res)))
#+END_SRC

Once the reader has accepted the s-expression, the symbols need to be switched back to their
original spellings:
#+BEGIN_SRC elisp :tangle install.el
  (defun shen/put-reserved-elisp-chars-back (sexp)
    (let ((symbols (shen/find-symbols sexp)))
      (shen/internal/modify-ast sexp
                       symbols
                       (lambda (path ast)
                         (shen/change-back (shen/internal/get-element-at path ast))))))
#+END_SRC

To do so we need a function that iterates over a symbols and replaces the sanitized
spelling with the original character:
#+BEGIN_SRC elisp :tangle install.el
  (defun shen/change-back (symbol)
    (let* ((original-length (length (symbol-name symbol)))
           (string-left (symbol-name symbol))
           (spelling->character
            (let ((hash (make-hash-table)))
              (mapc (lambda (spelling-character)
                        (puthash (nth 0 spelling-character) (nth 1 spelling-character) hash))
                      shen/*spelling->illegal-character*)
              hash))
           (spellings (hash-table-keys spelling->character))
           (get-character-and-remaining
            (lambda (S)
              (let ((found-at-index (shen/internal/index-of (lambda (spelling) (string-prefix-p spelling S)) spellings)))
                (if found-at-index
                    (let ((spelling (nth found-at-index spellings)))
                      (list (string (gethash spelling spelling->character))
                            (substring S (length spelling))))
                  (list (string (aref S 0))
                        (substring S 1))))))
           (reversed-result))
      (while (> (length string-left) 0)
        (let ((character-and-remaining (funcall get-character-and-remaining string-left)))
          (push (nth 0 character-and-remaining) reversed-result)
          (setq string-left (nth 1 character-and-remaining))))
      (intern (apply #'concat (reverse reversed-result)))))
#+END_SRC

And a function that collects paths to all symbols in an s-expression:
#+BEGIN_SRC elisp :tangle install.el
  (defun shen/find-symbols (sexp)
    (let ((symbols)
          (current-path)
          (current-list sexp)
          (current-list-length (length sexp))
          (current-index 0)
          (locally-scoped-symbols)
          (inner-lists))
      (while (or (< current-index current-list-length)
                 inner-lists)
        (cond
         ((and (= current-index current-list-length) inner-lists)
          (progn
            (setq current-path (car inner-lists))
            (setq inner-lists (cdr inner-lists))
            (setq current-list (shen/internal/get-element-at current-path sexp))
            (setq current-index 0)
            (setq current-list-length (length current-list))))
         ((< current-index current-list-length)
          (let ((current-token (nth current-index current-list)))
            (cond
             ((symbolp current-token)
              (push (cons current-index current-path) symbols))
             ((consp current-token)
              (push (cons current-index current-path)
                    inner-lists))
             (t nil))
            (setq current-index (+ current-index 1))))
         (t nil)))
      symbols))
#+END_SRC

