shen-elisp.org
** Iterating over KLambda Files
Now we can finally collect, and parse all the s-expressions in the
KLambda files and then pass the result to ~shen/eval-kl~ to transform
KLambda code into Elisp.
#+BEGIN_SRC elisp :tangle install.el
  (setq *temp-shen-buffer*
        (find-file-noselect
         (concat (file-name-as-directory default-directory)
                 (file-relative-name "shen-elisp.el"))))
  (defun eval-klambda-files (klambda-files)
    (with-current-buffer *temp-shen-buffer*
      (progn
        (erase-buffer)
        (insert "\
  ;;; shen-elisp.el --- An implementation of the Shen programming language  -*- lexical-binding: t -*-

  ;; Copyright (C) 2015-2018  Aditya Siram

  ;; Author: Aditya Siram <aditya.siram@gmail.com>
  ;; Homepage: https://github.com/deech/shen-elisp
  ;; License: BSD 3-Clause License
  ;;   http://opensource.org/licenses/BSD-3-Clause

  ;;; Commentary:

  ;; This is an implemenatation of the Shen programming language in
  ;; Elisp. The end goal is to provide:
  ;;
  ;; 1. An easy way to play with Shen with no other installation
  ;;    hassle (assuming you use Emacs).
  ;; 2. A first-class development experience when writing Shen.
  ;;    The idea is that an editor that understands the code can
  ;;    be much more helpful than one that does not. To this end
  ;;    the roadmap involves a full gamut of source code
  ;;    introspection and debugging tools.

  ;;; Code:

  (require 'shen-primitives)
  (setq max-lisp-eval-depth 60000)
  (setq max-specpdl-size 13000)\n\n")
        (goto-char (point-max))
        (dolist (klambda-file klambda-files nil)
          (eval-klambda-file klambda-file))
        (goto-char (point-max))
        (insert (format "%s\n" "(provide 'shen-elisp)"))
        (save-buffer))))
  (defun eval-klambda-file (klambda-file)
    (dolist (klambda-sexp-string (shen/get-klambda-sexp-strings klambda-file) nil)
      (eval-klambda-sexp-string klambda-sexp-string)))
  (defun eval-klambda-sexp-string (klambda-sexp-string)
    (let ((ast (shen/put-reserved-elisp-chars-back
                (read
                 (shen/remove-reserved-elisp-characters
                  klambda-sexp-string)))))
      (shen/kl-to-buffer ast *temp-shen-buffer*)))
#+END_SRC
* The Runner
#+BEGIN_SRC elisp :tangle install.el
  (defun compile-and-load (F)
    (byte-compile-file
     (concat (file-name-as-directory default-directory)
             (file-relative-name F))
     't))
  (defun load-klambda () (eval-klambda-files *klambda-files*))
  (defun load-only ()
    (progn
      (compile-and-load "shen-primitives.el")
      (compile-and-load "install.el")))
  (defun runner ()
    (progn
      (compile-and-load "shen-primitives.el")
      (compile-and-load "install.el")
      (eval-klambda-files *klambda-files*)
      (compile-and-load "shen-elisp.el")
      (compile-and-load "shen-overlays.el")
      (compile-and-load "shen-repl.el")
      (add-to-list 'load-path default-directory)
      (shen/repl)))
#+END_SRC
