shen-elisp.html

<div id="outline-container-org88f1618" class="outline-3">
<h3 id="org88f1618"><span class="section-number-3">11.3</span> Iterating over KLambda Files</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Now we can finally collect, and parse all the s-expressions in the
KLambda files and then pass the result to <code>shen/eval-kl</code> to transform
KLambda code into Elisp.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> *temp-shen-buffer*
      <span style="color: #7388D6;">(</span>find-file-noselect
       <span style="color: #909183;">(</span>concat <span style="color: #709870;">(</span>file-name-as-directory default-directory<span style="color: #709870;">)</span>
               <span style="color: #709870;">(</span>file-relative-name <span style="color: #008000;">"shen-elisp.el"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">eval-klambda-files</span> <span style="color: #7388D6;">(</span>klambda-files<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">with-current-buffer</span> *temp-shen-buffer*
    <span style="color: #909183;">(</span><span style="color: #0000FF;">progn</span>
      <span style="color: #709870;">(</span>erase-buffer<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #008000;">"\</span>
<span style="color: #008000;">;;; shen-elisp.el --- An implementation of the Shen programming language  -*- lexical-binding: t -*-</span>

<span style="color: #008000;">;; Copyright (C) 2015-2016  Aditya Siram</span>

<span style="color: #008000;">;; Author: Aditya Siram <a href="mailto:aditya.siram%40gmail.com">&lt;aditya.siram@gmail.com&gt;</a></span>
<span style="color: #008000;">;; Homepage: https://github.com/deech/shen-elisp</span>
<span style="color: #008000;">;; License: BSD 3-Clause License</span>
<span style="color: #008000;">;;   http://opensource.org/licenses/BSD-3-Clause</span>

<span style="color: #008000;">;;; Commentary:</span>

<span style="color: #008000;">;; This is an implemenatation of the Shen programming language in</span>
<span style="color: #008000;">;; Elisp. The end goal is to provide:</span>
<span style="color: #008000;">;;</span>
<span style="color: #008000;">;; 1. An easy way to play with Shen with no other installation</span>
<span style="color: #008000;">;;    hassle (assuming you use Emacs).</span>
<span style="color: #008000;">;; 2. A first-class development experience when writing Shen.</span>
<span style="color: #008000;">;;    The idea is that an editor that understands the code can</span>
<span style="color: #008000;">;;    be much more helpful than one that does not. To this end</span>
<span style="color: #008000;">;;    the roadmap involves a full gamut of source code</span>
<span style="color: #008000;">;;    introspection and debugging tools.</span>

<span style="color: #008000;">;;; Code:</span>

<span style="color: #008000;">(require 'shen-primitives)</span>
<span style="color: #008000;">(setq max-lisp-eval-depth 60000)</span>
<span style="color: #008000;">(setq max-specpdl-size 13000)\n\n"</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #907373;">(</span>klambda-file klambda-files nil<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>eval-klambda-file klambda-file<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #008000;">"%s\n"</span> <span style="color: #008000;">"(provide 'shen-elisp)"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>save-buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">eval-klambda-file</span> <span style="color: #7388D6;">(</span>klambda-file<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #909183;">(</span>klambda-sexp-string <span style="color: #709870;">(</span>shen/get-klambda-sexp-strings klambda-file<span style="color: #709870;">)</span> nil<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval-klambda-sexp-string klambda-sexp-string<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">eval-klambda-sexp-string</span> <span style="color: #7388D6;">(</span>klambda-sexp-string<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>ast <span style="color: #907373;">(</span>shen/put-reserved-elisp-chars-back
              <span style="color: #6276BA;">(</span>read
               <span style="color: #858580;">(</span>shen/remove-reserved-elisp-characters
                klambda-sexp-string<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/kl-to-buffer ast *temp-shen-buffer*<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org12cfa52" class="outline-2">
<h2 id="org12cfa52"><span class="section-number-2">12</span> The Runner</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">compile-and-load</span> <span style="color: #7388D6;">(</span>F<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>byte-compile-file
   <span style="color: #909183;">(</span>concat <span style="color: #709870;">(</span>file-name-as-directory default-directory<span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>file-relative-name F<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   't<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">load-klambda</span> <span style="color: #7388D6;">()</span> <span style="color: #7388D6;">(</span>eval-klambda-files *klambda-files*<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">load-only</span> <span style="color: #7388D6;">()</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">progn</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"shen-primitives.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"install.el"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">runner</span> <span style="color: #7388D6;">()</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">progn</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"shen-primitives.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"install.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval-klambda-files *klambda-files*<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"shen-elisp.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"shen-overlays.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #008000;">"shen-repl.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>add-to-load-path default-directory<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/repl<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aditya Siram</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>